{
  "name": "lammps6",
  "title": "Carbon Nanotube: Deformation and Breaking",
  "description": "LAMMPS simulation of a carbon nanotube under uniaxial strain, followed by strain release to observe relaxation toward equilibrium, with temperature monitored throughout the process.",
  "content": "This App demonstrates how to run a LAMMPS (Large-scale Atomic/Molecular Massively Parallel Simulator) molecular dynamics simulation using Camber. LAMMPS is a powerful and widely adopted tool in materials science, chemistry, and nanotechnology, enabling researchers to model interatomic interactions and solve Newton’s equations of motion to explore the atomic-scale behavior of matter under diverse physical conditions.In this use case, the App simulates the mechanical deformation of a carbon nanotube (CNT) structure under uniaxial strain. After applying the strain, the deformational force is suddenly released, allowing observation of the nanotube’s relaxation dynamics toward equilibrium. The system temperature can also be varied to study thermal effects on mechanical stability.This setup—referred to as the “unbreakable” simulation—highlights the exceptional resilience and complex behavior of CNTs at the atomic scale. Understanding how CNTs respond to sudden strain release is crucial for applications involving dynamic mechanical stress. Research shows that CNTs demonstrate near-perfect elastic recovery and minimal fatigue under cyclic or abrupt load conditions (Gupta et al., Sci. Adv., 2021; Duan et al., J. Appl. Phys., 2010). Their relaxation behavior is temperature-dependent, making thermal monitoring essential to capture the full energy dissipation and recovery dynamics (Bai et al., Science, 2020). These insights are highly relevant to the development of next-generation flexible electronics, nanocomposites, and thermal interface materials.To run the simulation, place the following three input files in the Simulation Path:unbreakable.lmp – the main LAMMPS input scriptunbreakable.data – initial structure of the carbon nanotubeunbreakable.inc – force field parametersUpon completion, two output files will be generated in the simulation folder:trajectory_with_arrows.gif – a visual animation of CNT deformation and relaxationtemperature.csv – temperature data recorded throughout the simulationThis simulation offers a scientifically grounded and visually intuitive way to explore the fascinating mechanical and thermal behavior of carbon nanotubes under stress.",
  "imageUrl": "https://docs.dev.camber.cloud/demos/30-applications/03-molecular-dynamics/lammps/sim.gif",
  "command": "rm -rf prod_apps && git clone https://github.com/CamberCloud-Inc/prod_apps.git && cd prod_apps/lammps && sh ./run_sim.sh ${stretchingTime}",
  "engineType": "LAMMPS",
  "jobConfig": [
    {
      "type": "Select",
      "label": "# of particles",
      "name": "system_size",
      "hidden": true,
      "description": "",
      "options": [
        {
          "label": "1e2 particles",
          "value": "1e2",
          "mapValue": {
            "nodeSize": "XSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        },
        {
          "label": "1e6 particles",
          "value": "1e6",
          "mapValue": {
            "nodeSize": "LARGE",
            "numNodes": 1,
            "withGpu": true
          }
        }
      ],
      "defaultValue": "1e2"
    }
  ],
  "spec": [
    {
      "type": "Select",
      "label": "Stretching Time",
      "name": "stretchingTime",
      "description": "Sets the velocity of the front and back faces of the nanotube, aiming to tear it apart",
      "defaultValue": "0",
      "hidden": false,
      "required": true,
      "disabled": false,
      "options": [
        {
          "label": "None",
          "value": "0"
        },
        {
          "label": "Weak",
          "value": "10000"
        },
        {
          "label": "Strong",
          "value": "30000"
        }
      ]
    }
  ]
}