{
  "name": "ddamsproteomics-tmt-labeling",
  "title": "DDA-MS Proteomics: TMT Labeling Quantification",
  "description": "Quantitative proteomics workflow for TMT (Tandem Mass Tag) labeled samples using data-dependent acquisition mass spectrometry. Enables multiplexed protein quantification across up to 35 samples simultaneously with high precision, ideal for comparative studies, biomarker discovery, and differential expression analysis.",
  "content": "<h1>DDA-MS Proteomics: TMT Labeling Quantification</h1><h2>What This Analysis Does</h2><p>This app performs comprehensive quantitative proteomics analysis of TMT-labeled samples using data-dependent acquisition (DDA) mass spectrometry. TMT (Tandem Mass Tags) is a robust multiplexing technology that allows simultaneous analysis of multiple samples (up to 35 with TMTpro) in a single mass spectrometry run, providing highly precise relative protein quantification with minimal technical variation.</p><p>The workflow processes raw mass spectrometry data through peptide identification, TMT reporter ion quantification, protein inference, statistical analysis, and quality control - delivering publication-ready results for differential protein expression studies.</p><h2>When To Use This</h2><ul><li><strong>Biomarker Discovery:</strong> Identify protein signatures distinguishing disease states, treatment responses, or biological conditions</li><li><strong>Drug Discovery:</strong> Profile proteome changes in response to drug treatments across multiple conditions</li><li><strong>Disease Research:</strong> Compare protein expression between healthy and disease samples with high precision</li><li><strong>Systems Biology:</strong> Map protein networks and pathways responding to experimental perturbations</li><li><strong>Time-Course Studies:</strong> Track protein expression changes across multiple time points simultaneously</li><li><strong>Tissue Comparisons:</strong> Quantify protein differences across tissues, cell types, or developmental stages</li><li><strong>Post-Translational Modifications:</strong> When combined with enrichment, analyze phosphorylation, acetylation, or other modifications</li></ul><h2>What You Need</h2><h3>1. Raw Mass Spectrometry Data</h3><p>You need TMT-labeled samples analyzed by LC-MS/MS:</p><ul><li><strong>File Format:</strong> Raw files from mass spectrometers (Thermo .raw, mzML, or mzXML formats)</li><li><strong>Acquisition:</strong> Data-dependent acquisition (DDA) mode with MS2 fragmentation</li><li><strong>TMT Labels:</strong> Samples labeled with TMT reagents (TMTduplex, TMT6plex, TMT10plex, TMT11plex, TMT16plex, or TMTpro 35plex)</li><li><strong>Fractionation:</strong> Optional but recommended - high pH reverse phase fractionation reduces sample complexity</li><li><strong>Quality:</strong> Proper TMT labeling efficiency (>95%) and sample pooling essential for accurate quantification</li></ul><h3>2. Experimental Design Sheet</h3><p>A metadata file describing your samples and TMT labeling scheme:</p><ul><li><strong>Sample Information:</strong> Biological conditions, replicates, and experimental groups</li><li><strong>TMT Channel Assignment:</strong> Which TMT reporter channel corresponds to each sample</li><li><strong>Batch Information:</strong> For multi-plex experiments spanning multiple TMT sets</li><li><strong>Normalization Controls:</strong> Optional reference channels or pooled samples</li></ul><h3>3. Protein Database (FASTA)</h3><p>Reference proteome for peptide identification:</p><ul><li><strong>Source:</strong> UniProt, NCBI, or organism-specific databases</li><li><strong>Content:</strong> Target proteins plus contaminants and decoy sequences</li><li><strong>Format:</strong> Standard FASTA format with protein headers</li><li><strong>Completeness:</strong> Comprehensive database improves identification sensitivity</li></ul><h3>4. Search Parameters</h3><p>Configure peptide identification settings:</p><ul><li><strong>Enzyme:</strong> Trypsin (default), Lys-C, or other proteases</li><li><strong>Modifications:</strong> TMT on lysine and N-terminus (fixed), methionine oxidation (variable), etc.</li><li><strong>Tolerances:</strong> Precursor and fragment mass tolerances appropriate for instrument</li><li><strong>FDR Threshold:</strong> False discovery rate for peptide/protein identification (typically 1%)</li></ul><h2>What You'll Get</h2><h3>Protein Quantification Results</h3><ul><li><strong>Protein abundance matrix:</strong> Quantified protein expression across all TMT channels</li><li><strong>Identification reports:</strong> Peptide and protein identifications with confidence scores</li><li><strong>Statistical results:</strong> Differential expression analysis with fold changes and p-values</li><li><strong>Normalized data:</strong> Corrected for loading variations and systematic biases</li></ul><h3>Quality Control Reports</h3><ul><li><strong>TMT label efficiency:</strong> Assessment of labeling completeness and quality</li><li><strong>Coefficient of variation:</strong> Technical replicate concordance (typically <15% for TMT)</li><li><strong>Identification metrics:</strong> Number of peptides, proteins, and PSMs identified</li><li><strong>Missing value analysis:</strong> Data completeness across samples and proteins</li><li><strong>Principal component analysis:</strong> Sample clustering and outlier detection</li><li><strong>MultiQC report:</strong> Comprehensive quality metrics across all samples</li></ul><h3>Statistical Analysis</h3><ul><li><strong>Differential abundance testing:</strong> Proteins significantly changed between conditions</li><li><strong>Volcano plots:</strong> Visualization of fold changes versus statistical significance</li><li><strong>Heatmaps:</strong> Hierarchical clustering of differentially expressed proteins</li><li><strong>Pathway enrichment:</strong> Gene ontology and pathway analysis of protein sets</li></ul><h3>Export Formats</h3><ul><li><strong>Tables:</strong> CSV/TSV files for further analysis in R, Python, or Excel</li><li><strong>Visualizations:</strong> Publication-ready plots and figures</li><li><strong>Search results:</strong> MaxQuant, FragPipe, or other search engine outputs</li><li><strong>Supplementary data:</strong> Complete results for manuscript supplementary tables</li></ul><h2>TMT Technology Overview</h2><p><strong>How TMT Labeling Works:</strong></p><p>TMT reagents are isobaric chemical tags that label peptide N-termini and lysine residues. Each TMT variant has the same mass but fragments during MS2 to produce unique reporter ions (e.g., 126, 127N, 127C, 128N... for TMT10plex). The intensity of these reporter ions reflects the relative abundance of proteins from each labeled sample.</p><p><strong>Key Advantages:</strong></p><ul><li><strong>High multiplexing:</strong> Analyze up to 35 samples simultaneously (TMTpro)</li><li><strong>Reduced technical variation:</strong> Samples processed together minimize experimental noise</li><li><strong>High precision:</strong> CVs typically 5-15%, better than label-free methods</li><li><strong>Complete data:</strong> Fewer missing values compared to label-free DDA</li><li><strong>Cost efficiency:</strong> Single MS run for multiple samples reduces instrument time</li></ul><p><strong>TMT Variants Available:</strong></p><ul><li><strong>TMTduplex:</strong> 2-plex for simple comparisons</li><li><strong>TMT6plex:</strong> 6 samples, classic format</li><li><strong>TMT10plex/11plex:</strong> 10-11 samples, widely used standard</li><li><strong>TMT16plex/18plex:</strong> 16-18 samples (TMTpro)</li><li><strong>TMTpro 35plex:</strong> 35 samples, maximum multiplexing</li></ul><h2>Workflow Steps</h2><ol><li><strong>Raw Data Import:</strong> Convert and validate mass spectrometry files</li><li><strong>Peptide Identification:</strong> Search against protein database using MaxQuant, Mascot, or FragPipe</li><li><strong>TMT Reporter Extraction:</strong> Quantify reporter ion intensities from MS2 spectra</li><li><strong>Quality Filtering:</strong> Remove low-quality identifications and contaminated spectra</li><li><strong>Protein Inference:</strong> Aggregate peptide evidence to protein-level identifications</li><li><strong>Normalization:</strong> Correct for loading differences and systematic biases</li><li><strong>Missing Value Imputation:</strong> Handle missing data appropriately</li><li><strong>Statistical Analysis:</strong> Test for differential abundance using MSstatsTMT or similar</li><li><strong>Pathway Analysis:</strong> Biological interpretation through enrichment analysis</li><li><strong>Report Generation:</strong> Comprehensive QC and results visualization</li></ol><h2>Expected Analysis Time</h2><ul><li><strong>Small dataset (3-6 samples, 5 fractions):</strong> 2-4 hours on SMALL</li><li><strong>Standard TMT10plex (10 samples, 12 fractions):</strong> 4-8 hours on MEDIUM</li><li><strong>Large TMT16plex (16 samples, 24 fractions):</strong> 8-16 hours on LARGE</li><li><strong>TMTpro 35plex (35 samples, extensive fractionation):</strong> 16-24 hours on XLARGE</li></ul><p><strong>Note:</strong> Time depends on number of fractions, database size, and search parameters. Deep searches increase sensitivity but require longer computation.</p><h2>Interpreting Results</h2><p><strong>Protein Quantification Quality:</strong></p><ul><li><strong>PSMs (Peptide Spectrum Matches):</strong> Higher numbers indicate better coverage</li><li><strong>Protein FDR:</strong> Should be ≤1% for confident identifications</li><li><strong>TMT purity:</strong> >75% isolation purity reduces ratio compression</li><li><strong>Missing values:</strong> <20% missing per protein group preferred</li></ul><p><strong>Statistical Significance:</strong></p><ul><li><strong>Fold change:</strong> Biological significance threshold (e.g., >1.5-fold or >2-fold)</li><li><strong>Adjusted p-value:</strong> Statistical significance after multiple testing correction (e.g., q<0.05)</li><li><strong>Number of peptides:</strong> Proteins identified by more peptides are more reliable</li></ul><p><strong>Common Quality Metrics:</strong></p><ul><li><strong>Typical identification depth:</strong> 5,000-10,000 proteins in human/mouse samples</li><li><strong>Expected CV:</strong> 5-15% for technical replicates</li><li><strong>TMT labeling efficiency:</strong> Should be >95% for accurate quantification</li></ul><h2>Scientific Background</h2><p>TMT technology was developed to enable multiplexed quantitative proteomics using isobaric mass tags. The original TMT reagents (TMT6plex) were introduced in the mid-2000s, with subsequent expansions to TMT10plex/11plex (2011), TMT16plex (2019), and TMTpro 35plex (2024). DDA-MS acquisition coupled with TMT labeling has become a gold standard for high-precision comparative proteomics.</p><p>The workflow typically uses search engines like MaxQuant, Mascot, or FragPipe for peptide identification, followed by statistical analysis using tools like MSstatsTMT, Perseus, or DEqMS. High pH reverse phase fractionation is commonly used to reduce sample complexity and increase proteome coverage.</p><p>Recent advances include the AccelerOme platform for automated TMT labeling and the development of more efficient search algorithms and normalization methods to reduce ratio compression and improve quantitative accuracy.</p><h2>Tips for Success</h2><ul><li><strong>Complete labeling:</strong> Ensure >95% TMT labeling efficiency at peptide N-termini and lysines</li><li><strong>Equal loading:</strong> Pool equal amounts of each labeled sample for optimal quantification</li><li><strong>Include controls:</strong> Use pooled reference or internal standards for normalization</li><li><strong>Sufficient replicates:</strong> Minimum 3 biological replicates per condition recommended</li><li><strong>Fractionation:</strong> Use high pH RP fractionation to increase depth (8-24 fractions typical)</li><li><strong>Isolation purity:</strong> Optimize MS2 isolation width to minimize ratio compression</li><li><strong>Check raw data:</strong> Inspect spectra quality before committing to full analysis</li></ul><h2>Limitations and Considerations</h2><ul><li><strong>Ratio compression:</strong> TMT quantification can underestimate fold changes due to co-isolation</li><li><strong>Instrument requirements:</strong> Requires high-resolution MS2 for accurate reporter ion quantification</li><li><strong>Cost:</strong> TMT reagents are expensive compared to label-free approaches</li><li><strong>Sample pooling:</strong> All samples must be labeled and combined before MS analysis</li><li><strong>Dynamic range:</strong> Lower than MS1-based methods (label-free or SILAC)</li><li><strong>Batch effects:</strong> Large studies spanning multiple TMT sets require careful normalization</li></ul><h2>Comparison with Other Methods</h2><p><strong>TMT vs. Label-Free DDA:</strong> TMT provides higher precision (lower CVs) and fewer missing values, but has narrower dynamic range and higher cost. Label-free has better accuracy for large fold changes.</p><p><strong>TMT vs. DIA (Data-Independent Acquisition):</strong> DIA offers better quantitative accuracy and dynamic range, while TMT provides higher reproducibility and better handling of complex samples. Recent studies (2024-2025) show DIA identifying 15-20% fewer proteins but with 10-30% better accuracy in fold change measurements.</p><p><strong>TMT vs. SILAC:</strong> TMT allows more multiplexing and works with any sample type, while SILAC requires metabolic labeling (limited to cell culture) but provides more accurate quantification.</p><h2>Further Reading</h2><p><a href='https://www.mcponline.org/article/S1535-9476(20)31552-8/fulltext' target='_blank'>TMT Labeling for the Masses: A Robust and Cost-efficient Approach (MCP 2019)</a></p><p><a href='https://pubmed.ncbi.nlm.nih.gov/33950506/' target='_blank'>Quantitative Proteome Data Analysis of TMT Labeled Samples (Methods Mol Biol 2021)</a></p><p><a href='https://www.nature.com/articles/s41586-021-03819-2' target='_blank'>Recent advances in TMT-based proteomics workflows</a></p><p><a href='https://training.galaxyproject.org/training-material/topics/proteomics/tutorials/maxquant-msstats-tmt/tutorial.html' target='_blank'>MaxQuant and MSstats Tutorial for TMT Data Analysis</a></p>",
  "imageUrl": "https://www.thermofisher.com/blog/behindthebench/wp-content/uploads/sites/5/2020/08/TMT-Labeling.png",
  "command": "nextflow run nf-core/quantms --input ${input} --database ${database} --outdir ${output} --acquisition_method DDA --labelling_type TMT --tmt_level 3 --search_engine msgf --enable_qc true --posterior_probabilities percolator -r 1.3.0 -c /etc/mpi/nextflow.camber.config -profile singularity",
  "engineType": "NEXTFLOW",
  "version": "1.3.0",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "description": "Select compute resources based on dataset size. TMT analysis is computationally intensive - choose size based on number of fractions and samples.",
      "options": [
        {
          "label": "XSMALL (4 CPUs, 15GB RAM) - Testing with nf-core test data only",
          "value": "xsmall",
          "mapValue": {"nodeSize": "XSMALL", "numNodes": 1, "withGpu": false}
        },
        {
          "label": "SMALL (8 CPUs, 30GB RAM) - Small TMT experiments (3-6 samples, ≤5 fractions)",
          "value": "small",
          "mapValue": {"nodeSize": "SMALL", "numNodes": 1, "withGpu": false}
        },
        {
          "label": "MEDIUM (32 CPUs, 120GB RAM) - Standard TMT10plex (10 samples, 8-12 fractions)",
          "value": "medium",
          "mapValue": {"nodeSize": "MEDIUM", "numNodes": 1, "withGpu": false}
        },
        {
          "label": "LARGE (64 CPUs, 360GB RAM) - Large TMT16plex (16 samples, 12-24 fractions)",
          "value": "large",
          "mapValue": {"nodeSize": "LARGE", "numNodes": 1, "withGpu": false}
        },
        {
          "label": "XLARGE (128 CPUs, 720GB RAM) - TMTpro 35plex or extensive fractionation",
          "value": "xlarge",
          "mapValue": {"nodeSize": "XLARGE", "numNodes": 1, "withGpu": false}
        }
      ],
      "defaultValue": "medium"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "label": "Sample Information Sheet (SDRF)",
      "name": "input",
      "description": "Sample and Data Relationship Format (SDRF) file describing your TMT experiment: sample metadata, TMT channel assignments, raw file locations, and experimental design. See nf-core/quantms documentation for SDRF format specifications.",
      "defaultValue": "https://raw.githubusercontent.com/nf-core/test-datasets/quantms/testdata/tmt_phospho/sdrf.tsv",
      "required": true
    },
    {
      "type": "Stash File",
      "label": "Protein Database (FASTA)",
      "name": "database",
      "description": "FASTA file containing protein sequences for peptide identification. Should include target proteins, common contaminants, and optionally reverse decoy sequences. UniProt reference proteomes recommended.",
      "defaultValue": "https://raw.githubusercontent.com/nf-core/test-datasets/quantms/testdata/database/uniprot-human-reviewed-20220610.fasta",
      "required": true
    },
    {
      "type": "Stash File",
      "label": "Output Directory",
      "name": "output",
      "description": "Directory where all results will be saved: protein quantification tables, statistical reports, quality control metrics, and visualizations.",
      "defaultValue": "./tmt-labeling-results",
      "required": true
    },
    {
      "type": "Select",
      "label": "TMT Labeling Type",
      "name": "tmt_type",
      "description": "Select the TMT reagent kit used for labeling your samples. This determines the expected number of reporter ion channels.",
      "options": [
        {"label": "TMT 6-plex (126, 127, 128, 129, 130, 131)", "value": "tmt6plex"},
        {"label": "TMT 10-plex (126-131 with N/C variants)", "value": "tmt10plex"},
        {"label": "TMT 11-plex (adds 131C channel)", "value": "tmt11plex"},
        {"label": "TMT 16-plex / TMTpro 16-plex", "value": "tmt16plex"},
        {"label": "TMTpro 18-plex", "value": "tmt18plex"}
      ],
      "defaultValue": "tmt10plex",
      "required": false,
      "hidden": false
    },
    {
      "type": "Select",
      "label": "Search Engine",
      "name": "search_engine",
      "description": "Peptide identification search engine. MSGF+ is recommended for TMT data due to excellent scoring and FDR control.",
      "options": [
        {"label": "MSGF+ (recommended for TMT)", "value": "msgf"},
        {"label": "Comet", "value": "comet"},
        {"label": "X!Tandem", "value": "xtandem"}
      ],
      "defaultValue": "msgf",
      "required": false,
      "hidden": false
    },
    {
      "type": "Input",
      "label": "Precursor Mass Tolerance",
      "name": "precursor_mass_tolerance",
      "description": "Precursor ion mass tolerance in ppm for peptide identification (typical: 10-20 ppm for high-resolution instruments).",
      "defaultValue": "10",
      "required": false,
      "hidden": false
    },
    {
      "type": "Input",
      "label": "Fragment Mass Tolerance",
      "name": "fragment_mass_tolerance",
      "description": "Fragment ion mass tolerance in Da for peptide identification (typical: 0.02 Da for high-resolution MS2).",
      "defaultValue": "0.02",
      "required": false,
      "hidden": false
    },
    {
      "type": "Input",
      "label": "Protein FDR Threshold",
      "name": "protein_level_fdr_cutoff",
      "description": "False discovery rate threshold for protein identification (standard: 0.01 for 1% FDR).",
      "defaultValue": "0.01",
      "required": false,
      "hidden": false
    },
    {
      "type": "Checkbox",
      "label": "Enable Comprehensive QC",
      "name": "enable_qc",
      "description": "Generate detailed quality control reports and visualizations including PSM statistics, protein coverage, and TMT channel balance.",
      "defaultValue": true,
      "required": false,
      "hidden": false
    }
  ],
  "tags": [
    {"name": "proteomics", "type": "subfield"},
    {"name": "quantitative-proteomics", "type": "task"},
    {"name": "mass-spectrometry", "type": "technique"},
    {"name": "tmt-labeling", "type": "method"},
    {"name": "differential-expression", "type": "analysis"},
    {"name": "biology", "type": "field"},
    {"name": "biomarker-discovery", "type": "application"}
  ]
}
