{
  "name": "biomni-find-n-glycosylation-motifs",
  "title": "Biomni: Find N Glycosylation Motifs",
  "description": "Scan a protein sequence for N-linked glycosylation sequons (N-X-[S/T])",
  "content": "<h3>Overview</h3><p>This tool identifies N-linked glycosylation motifs (sequons) in protein sequences using the canonical N-X-[S/T] pattern, where X is any amino acid except proline. N-glycosylation is a critical post-translational modification that affects protein folding, stability, trafficking, and function. The tool scans protein sequences to locate potential N-glycosylation sites, which are essential for designing therapeutic proteins, optimizing recombinant protein expression, and engineering glycoproteins with desired properties.</p><h3>Input Parameters</h3><ul><li><strong>sequence</strong> (string, required): The protein sequence to analyze in single-letter amino acid code (e.g., 'MNKTSVILQGPPGTGKTSLAKALAAQNAIGVLIGP'). The sequence should contain standard amino acid letters.</li><li><strong>allow_overlap</strong> (boolean, optional, default: false): Whether to allow overlapping motifs to be reported. When set to true, overlapping N-X-S/T patterns will all be identified. When false, only non-overlapping motifs are reported.</li></ul><h3>Input Format</h3><p>The input should be a JSON file with the following structure:</p><pre>{\n  \"sequence\": \"MNKTSVILQGPPGTGKTSLAKALAAQNAIGVLIGP\",\n  \"allow_overlap\": false\n}</pre><h3>Biological Use Case</h3><p>N-glycosylation site identification is crucial for:</p><ul><li><strong>Therapeutic protein design</strong>: Identifying and optimizing glycosylation sites in monoclonal antibodies, fusion proteins, and enzyme replacement therapies to improve pharmacokinetics and reduce immunogenicity.</li><li><strong>Protein engineering</strong>: Removing or adding N-glycosylation sites to modulate protein expression levels, solubility, and biological activity.</li><li><strong>Biosimilar development</strong>: Ensuring glycosylation patterns match reference products by identifying all potential N-glycosylation sites.</li><li><strong>Structure-function studies</strong>: Understanding how N-glycosylation affects protein conformation and interactions with receptors or other biomolecules.</li></ul><h3>Output</h3><p>The tool generates a JSON file (glycosylation_motifs.json) containing a list of identified N-glycosylation motifs. Each motif includes the position in the sequence, the specific sequon pattern found, and the amino acid context. The output provides actionable information for site-directed mutagenesis, glycoengineering strategies, and expression optimization.</p><h3>Category</h3><p>glycoengineering</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/glycoengineering/find_n_glycosylation_motifs.py -s \"${sequence}\" ${allowOverlap} -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Text Area",
      "name": "sequence",
      "label": "Protein Sequence",
      "description": "Enter the protein sequence to analyze in single-letter amino acid code",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Boolean",
      "name": "allowOverlap",
      "label": "Allow Overlapping Motifs",
      "description": "Allow overlapping N-X-S/T patterns to be reported",
      "defaultValue": false,
      "mapValue": {
        "true": "--allow-overlap",
        "false": ""
      }
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}