{
  "name": "biomni-predict-o-glycosylation-hotspots",
  "title": "Biomni: Predict O Glycosylation Hotspots",
  "description": "Heuristic O-glycosylation hotspot scoring",
  "content": "<h3>Overview</h3><p>This tool predicts O-linked glycosylation hotspots in protein sequences using heuristic scoring based on local amino acid composition and structural context. Unlike N-glycosylation which has a well-defined sequon, O-glycosylation occurs on serine and threonine residues without a strict consensus motif. This tool identifies regions enriched in S/T residues and applies contextual rules (such as proline proximity) to score potential O-glycosylation hotspots. O-glycosylation plays critical roles in mucin-type proteins, extracellular domains, and protein-protein interactions, making hotspot prediction valuable for protein engineering and therapeutic design.</p><h3>Input Parameters</h3><ul><li><strong>sequence</strong> (string, required): The protein sequence to analyze in single-letter amino acid code (e.g., 'MTSPPSTSTPAPSTPVPTTPSS'). The sequence should contain standard amino acid letters.</li><li><strong>window</strong> (integer, optional, default: 7): The sliding window size used to calculate local S/T enrichment. A larger window considers broader regional context, while a smaller window focuses on immediate local composition. Typical values range from 5 to 11.</li><li><strong>min_st_fraction</strong> (float, optional, default: 0.4): The minimum fraction of serine and threonine residues within the window to consider it a potential hotspot. Values range from 0.0 to 1.0. Higher values (e.g., 0.5) identify only highly S/T-enriched regions, while lower values (e.g., 0.3) are more permissive.</li><li><strong>disallow_proline_next</strong> (boolean, optional, default: true): Whether to exclude S/T residues immediately followed by proline from hotspot consideration. Proline in the +1 position often inhibits O-glycosylation, so this filter improves prediction accuracy.</li></ul><h3>Input Format</h3><p>The input should be a JSON file with the following structure:</p><pre>{\n  \"sequence\": \"MTSPPSTSTPAPSTPVPTTPSS\",\n  \"window\": 7,\n  \"min_st_fraction\": 0.4,\n  \"disallow_proline_next\": true\n}</pre><h3>Biological Use Case</h3><p>O-glycosylation hotspot prediction is important for:</p><ul><li><strong>Mucin-type protein engineering</strong>: Mucins are heavily O-glycosylated proteins that form protective barriers on epithelial surfaces. Identifying hotspots helps design mucin-mimetic therapeutics with desired properties.</li><li><strong>Therapeutic protein optimization</strong>: O-glycosylation affects protein half-life, immunogenicity, and protease resistance. Engineering hotspots can modulate these properties in biologics.</li><li><strong>Fc region engineering</strong>: Some therapeutic antibodies have O-glycosylation in hinge regions. Predicting and modulating these sites can alter effector functions and stability.</li><li><strong>Vaccine design</strong>: Many viral and bacterial glycoproteins contain O-glycosylation hotspots that influence immune recognition. Understanding these regions aids in immunogen design.</li><li><strong>Bioprocessing optimization</strong>: O-glycosylation patterns vary between expression systems. Predicting hotspots helps anticipate glycoform heterogeneity in recombinant production.</li></ul><h3>Output</h3><p>The tool generates a JSON file (o_glycosylation_hotspots.json) containing scored regions and individual residues with high O-glycosylation potential. The output includes position information, local S/T density scores, and contextual features that contribute to the hotspot prediction. This information guides site-directed mutagenesis strategies and helps prioritize experimental validation of predicted O-glycosylation sites.</p><h3>Category</h3><p>glycoengineering</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/glycoengineering/predict_o_glycosylation_hotspots.py -s \"${sequence}\" -w ${window} -m ${minStFraction} ${disallowProlineNext} -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Text Area",
      "name": "sequence",
      "label": "Protein Sequence",
      "description": "Enter the protein sequence to analyze in single-letter amino acid code",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Input",
      "name": "window",
      "label": "Window Size",
      "description": "Sliding window size for calculating local S/T enrichment (typical: 5-11)",
      "defaultValue": 7,
      "min": 3,
      "max": 20
    },
    {
      "type": "Input",
      "name": "minStFraction",
      "label": "Minimum S/T Fraction",
      "description": "Minimum fraction of serine and threonine residues to consider as hotspot (0.0-1.0)",
      "defaultValue": 0.4,
      "min": 0.0,
      "max": 1.0,
      "step": 0.05
    },
    {
      "type": "Checkbox",
      "name": "disallowProlineNext",
      "label": "Disallow Proline Next",
      "description": "Exclude S/T residues immediately followed by proline from consideration",
      "defaultValue": true,
      "mapValue": {
        "true": "--disallow-proline-next",
        "false": "--allow-proline-next"
      }
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}