{
  "name": "biomni-analyze-cfse-cell-proliferation",
  "title": "Biomni: Analyze Cfse Cell Proliferation",
  "description": "Analyze CFSE-labeled cell samples to quantify cell division and proliferation using flow cytometry data",
  "content": "<h3>Overview</h3><p>Analyze CFSE (Carboxyfluorescein Succinimidyl Ester)-labeled cell samples to quantify cell division events and proliferation dynamics using flow cytometry data. CFSE is diluted by half with each cell division, allowing precise tracking of proliferation across multiple generations. This tool deconvolutes CFSE fluorescence histograms to determine the number of cell divisions and calculate proliferation indices.</p><h3>Input Parameters</h3><ul><li><strong>fcs_file_path</strong> (string, required): Path to the FCS (Flow Cytometry Standard) file containing CFSE-labeled cell data</li><li><strong>cfse_channel</strong> (string, optional): Name of the fluorescence channel measuring CFSE signal (e.g., 'FL1-A', 'FITC-A', 'GFP-A'). Default: 'FL1-A'</li><li><strong>lymphocyte_gate</strong> (dict or null, optional): Gating parameters to select lymphocyte population based on FSC/SSC. If null, analyzes all events. Default: null</li></ul><h3>Input Format</h3><pre>{\n  \"fcs_file_path\": \"/path/to/cfse_sample.fcs\",\n  \"cfse_channel\": \"FL1-A\",\n  \"lymphocyte_gate\": null\n}</pre><h3>Biological Use Case</h3><p>Gold standard method for measuring immune cell proliferation in vitro and ex vivo. Applications include: (1) Quantifying T cell proliferation in response to antigen stimulation, (2) Measuring B cell division following BCR cross-linking or TLR activation, (3) Assessing NK cell expansion during cytokine treatment, (4) Evaluating suppressive capacity of regulatory T cells on effector T cell proliferation, (5) Determining optimal conditions for expanding therapeutic immune cells, and (6) Studying cell division kinetics in mixed lymphocyte reactions (MLR) for transplantation research.</p><h3>Output</h3><p>Produces detailed proliferation analysis including: proliferation index (average number of divisions), division index, percentage of cells in each generation (0-8+ divisions), precursor frequency calculations, and expansion index. Results are saved to 'cfse_proliferation_results.txt' with statistical summaries of proliferative responses.</p><h3>Category</h3><p>immunology</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/immunology/analyze_cfse_cell_proliferation.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}