{
  "name": "biomni-isolate-purify-immune-cells",
  "title": "Biomni: Isolate Purify Immune Cells",
  "description": "Simulate isolation and purification of immune cells from tissue samples using enzymatic digestion and MACS",
  "content": "<h3>Overview</h3><p>Generate comprehensive protocols for isolating and purifying specific immune cell populations from tissue samples using enzymatic digestion followed by magnetic-activated cell sorting (MACS). This tool provides step-by-step guidance for tissue dissociation, single-cell suspension preparation, and positive or negative selection strategies to obtain highly purified immune cell subsets with optimal viability and functionality.</p><h3>Input Parameters</h3><ul><li><strong>tissue_type</strong> (string, required): Type of tissue source for cell isolation (e.g., 'spleen', 'lymph_node', 'blood', 'bone_marrow', 'thymus', 'intestine', 'liver', 'lung', 'skin')</li><li><strong>target_cell_type</strong> (string, required): Specific immune cell population to isolate (e.g., 'CD4_T_cells', 'CD8_T_cells', 'B_cells', 'NK_cells', 'macrophages', 'dendritic_cells', 'neutrophils', 'regulatory_T_cells')</li><li><strong>enzyme_type</strong> (string, optional): Enzyme for tissue digestion (e.g., 'collagenase', 'liberase', 'DNase', 'dispase'). Default: 'collagenase'</li><li><strong>macs_antibody</strong> (string or null, optional): Specific antibody for MACS selection (e.g., 'CD4', 'CD19', 'CD11c'). If null, tool recommends appropriate antibody based on target cell type. Default: null</li><li><strong>digestion_time_min</strong> (int, optional): Duration of enzymatic digestion in minutes. Default: 45</li></ul><h3>Input Format</h3><pre>{\n  \"tissue_type\": \"spleen\",\n  \"target_cell_type\": \"CD8_T_cells\",\n  \"enzyme_type\": \"collagenase\",\n  \"macs_antibody\": \"CD8a\",\n  \"digestion_time_min\": 30\n}</pre><h3>Biological Use Case</h3><p>Fundamental procedure for all immunology research requiring purified cell populations. Applications include: (1) Isolating naive CD4+ T cells for in vitro differentiation into Th1, Th2, or Th17 subsets, (2) Purifying regulatory T cells for suppression assays and adoptive transfer experiments, (3) Obtaining dendritic cells for antigen presentation studies and vaccine development, (4) Isolating tumor-infiltrating lymphocytes for cancer immunotherapy research, (5) Purifying B cell subsets for antibody production and class switching studies, (6) Obtaining macrophages for polarization experiments (M1 vs. M2), and (7) Isolating NK cells for cytotoxicity assays against tumor targets.</p><h3>Output</h3><p>Generates detailed isolation protocol including: tissue processing steps with specific buffer compositions, enzymatic digestion conditions (temperature, time, enzyme concentration), filtration and washing procedures, red blood cell lysis protocol if applicable, MACS separation instructions with antibody recommendations and column selection, quality control checkpoints including expected yield and purity, viability assessment methods, and troubleshooting guidelines. Protocol saved to 'isolation_protocol.txt'.</p><h3>Category</h3><p>immunology</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/immunology/isolate_purify_immune_cells.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}