{
  "name": "biomni-track-immune-cells-under-flow",
  "title": "Biomni: Track Immune Cells Under Flow",
  "description": "Track immune cells under flow conditions and classify their behaviors (rolling, firm adhesion, detachment)",
  "content": "<h3>Overview</h3><p>Track and analyze immune cell behavior under physiological flow conditions using time-lapse microscopy image sequences. This tool performs automated cell tracking to quantify and classify leukocyte-endothelial interactions including rolling (selectin-mediated), firm adhesion (integrin-mediated), and detachment events. The analysis provides insights into the multi-step adhesion cascade critical for immune cell recruitment to sites of inflammation.</p><h3>Input Parameters</h3><ul><li><strong>image_sequence_path</strong> (string, required): Path to directory containing time-lapse microscopy images or path to multi-frame TIFF file showing immune cells under flow conditions</li><li><strong>pixel_size_um</strong> (float, optional): Physical size of each pixel in micrometers for accurate velocity and distance measurements. Default: 1.0</li><li><strong>time_interval_sec</strong> (float, optional): Time interval between consecutive frames in seconds. Default: 1.0</li><li><strong>flow_direction</strong> (string, optional): Direction of flow in the imaging field ('left', 'right', 'up', 'down') for orientation of velocity vectors. Default: 'right'</li></ul><h3>Input Format</h3><pre>{\n  \"image_sequence_path\": \"/path/to/flow_chamber_images/\",\n  \"pixel_size_um\": 0.65,\n  \"time_interval_sec\": 0.5,\n  \"flow_direction\": \"right\"\n}</pre><h3>Biological Use Case</h3><p>Essential for studying leukocyte trafficking and the inflammatory response. Applications include: (1) Characterizing selectin-mediated rolling of neutrophils on activated endothelium during acute inflammation, (2) Quantifying integrin-dependent firm adhesion of T cells to vascular endothelium for extravasation studies, (3) Evaluating effects of chemokines (IL-8, MCP-1) on leukocyte arrest under shear stress, (4) Assessing adhesion molecule expression (P-selectin, E-selectin, ICAM-1, VCAM-1) by analyzing rolling velocity and adhesion efficiency, (5) Studying platelet-leukocyte interactions in thromboinflammation, (6) Testing anti-adhesion therapeutics for inflammatory diseases, and (7) Investigating lymphocyte homing to high endothelial venules (HEVs) in lymph nodes.</p><h3>Output</h3><p>Provides comprehensive tracking analysis including: individual cell trajectories with (x,y) coordinates over time, rolling velocities (μm/s) for each tracked cell, classification of cellular behavior (free-flowing, rolling, firmly adherent, detached), adhesion duration statistics, displacement and directionality measurements, interaction frequency calculations, and population-level summary statistics. Results include annotated video/images with cell tracks and detailed metrics saved to 'tracking_results.txt'.</p><h3>Category</h3><p>immunology</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/immunology/track_immune_cells_under_flow.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}