{
  "name": "biomni-bayesian-finemapping-with-deep-vi",
  "title": "Biomni: Bayesian Finemapping With Deep Vi",
  "description": "Perform Bayesian fine-mapping from GWAS summary statistics using deep variational inference",
  "content": "<h3>Overview</h3><p>This advanced tool performs Bayesian fine-mapping analysis on genome-wide association study (GWAS) data using deep variational inference. It identifies causal variants from association signals by accounting for linkage disequilibrium structure, produces posterior inclusion probabilities for variants, and constructs credible sets of likely causal SNPs. The deep learning approach provides scalable and accurate fine-mapping for complex genetic architectures.</p><h3>Input Parameters</h3><ul><li><strong>gwas_summary</strong> (string): Path to GWAS summary statistics file (CSV or TSV format) with columns for variant ID, chromosome, position, effect size, standard error, and p-value</li><li><strong>ld_matrix</strong> (string): Path to linkage disequilibrium correlation matrix file (NumPy .npy format) representing LD structure between variants</li><li><strong>n_iterations</strong> (integer, optional): Number of training iterations for optimization (default: 5000)</li><li><strong>learning_rate</strong> (float, optional): Learning rate for gradient descent optimization (default: 0.01)</li><li><strong>hidden_dim</strong> (integer, optional): Hidden dimension size for neural network architecture (default: 64)</li><li><strong>credible_threshold</strong> (float, optional): Probability threshold for credible set construction (default: 0.95 for 95% credible sets)</li></ul><h3>Input Format</h3><pre>GWAS summary statistics (CSV/TSV):\nvariant_id,chr,pos,beta,se,pval\nrs1234,1,1000000,0.15,0.03,1.2e-8\nrs5678,1,1000500,0.12,0.04,3.5e-6\n\nLD matrix (NumPy array):\nnp.save('ld_matrix.npy', ld_matrix)\n# Shape: (n_variants, n_variants)\n# Values: correlation coefficients between -1 and 1</pre><h3>Biological Use Case</h3><p>Essential for post-GWAS analysis to pinpoint causal variants: identifying functional variants driving disease associations, prioritizing variants for functional validation, integrating GWAS with functional genomics data, fine-mapping complex traits with multiple causal variants, and designing follow-up experiments. Particularly valuable for translating GWAS findings into mechanistic insights and therapeutic targets.</p><h3>Output</h3><p>Produces comprehensive fine-mapping results: posterior inclusion probabilities (PIP) for each variant, ranked list of likely causal variants, 95% credible sets of causal variants, visualization plots showing PIPs across genomic region, convergence diagnostics, and detailed log file (bayesian_finemapping_log.txt) with model parameters, credible set composition, and statistical summaries.</p><h3>Category</h3><p>genetics</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/genetics/bayesian_finemapping_with_deep_vi.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}