{
  "name": "biomni-extract-url-content",
  "title": "Biomni: Extract URL Content",
  "description": "Extract cleaned text content from a webpage using requests and BeautifulSoup. Removes scripts, styles, navigation, and other non-content elements.",
  "content": "<h3>Overview</h3><p>Extract cleaned text content from webpages containing scientific information using requests and BeautifulSoup. Automatically removes scripts, styles, navigation, advertisements, and other non-content elements to provide clean, readable text suitable for analysis.</p><h3>Input Parameters</h3><ul><li><strong>url</strong> (required): URL of the webpage to extract content from</li></ul><h3>Biological Use Case</h3><p>Useful for extracting article content from journal websites, research news, blog posts, and other web-based scientific resources. Use cases include: gathering content from journal article landing pages, extracting protocol descriptions from lab websites, collecting data from research group pages, harvesting information from scientific databases and repositories, and processing content from science news and review websites. The cleaned text output is ideal for text mining, content analysis, and information extraction workflows.</p><h3>Output</h3><p>Returns a text file (url_content.txt) containing the cleaned, extracted text content from the webpage. All HTML formatting, navigation elements, and extraneous content are removed, leaving only the main textual content.</p><h3>Category</h3><p>literature</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/literature/extract_url_content.py --url \"${url}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Input",
      "name": "url",
      "label": "URL",
      "description": "URL of the webpage to extract content from",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}