{
  "name": "biomni-query-pubmed",
  "title": "Biomni: Query Pubmed",
  "description": "Search PubMed for research papers based on the provided query. Automatically retries with simplified queries if no results are found.",
  "content": "<h3>Overview</h3><p>Search PubMed database for biomedical and life sciences research papers. PubMed comprises over 35 million citations from MEDLINE, life science journals, and online books, maintained by the National Center for Biotechnology Information (NCBI). The tool automatically retries with simplified queries if initial searches return no results, ensuring robust literature retrieval.</p><h3>Input Parameters</h3><ul><li><strong>query</strong> (required): Search query string using PubMed syntax or natural language</li><li><strong>max_papers</strong> (optional): Maximum number of papers to return (default: 10)</li><li><strong>max_retries</strong> (optional): Maximum number of retry attempts with simplified queries (default: 3)</li></ul><h3>Input Format</h3><pre><code class=\"language-json\">{\n  \"query\": \"CRISPR Cas9 gene therapy clinical trials\",\n  \"max_papers\": 10,\n  \"max_retries\": 3\n}</code></pre><h3>Biological Use Case</h3><p>The primary database for biomedical literature searches across all life sciences disciplines. Use cases include: systematic literature reviews for meta-analyses, finding clinical trial results and medical research, discovering disease mechanisms and therapeutic approaches, locating method papers for experimental protocols, identifying key publications in specific research areas, and tracking publication history of genes or proteins. PubMed's comprehensive coverage makes it essential for evidence-based research, grant writing, and staying current with biomedical advances.</p><h3>Output</h3><p>Returns a text file (pubmed_results.txt) with formatted citations including paper titles, authors, journal information, publication dates, PMIDs (PubMed IDs), abstracts, and direct PubMed links. Results are sorted by relevance with most pertinent papers listed first.</p><h3>Category</h3><p>literature</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/literature/query_pubmed.py --query \"${query}\" --max_papers \"${max_papers}\" --max_retries \"${max_retries}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Input",
      "name": "query",
      "label": "Query",
      "description": "Search query string using PubMed syntax or natural language",
      "defaultValue": ""
    },
    {
      "type": "Input",
      "name": "max_papers",
      "label": "Max Papers",
      "description": "Maximum number of papers to return (default: 10)",
      "defaultValue": "10"
    },
    {
      "type": "Input",
      "name": "max_retries",
      "label": "Max Retries",
      "description": "Maximum number of retry attempts with simplified queries (default: 3)",
      "defaultValue": "3"
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}