{
  "name": "biomni-query-scholar",
  "title": "Biomni: Query Scholar",
  "description": "Search Google Scholar for papers based on the provided query. Returns the first search result with title, year, venue, and abstract.",
  "content": "<h3>Overview</h3><p>Search Google Scholar for academic papers and scholarly literature based on your query. Google Scholar indexes scholarly articles across all disciplines and sources including peer-reviewed papers, theses, books, abstracts, and court opinions from academic publishers, professional societies, universities, and other scholarly organizations.</p><h3>Input Parameters</h3><ul><li><strong>query</strong> (required): Search query string for scholarly literature</li></ul><h3>Input Format</h3><pre><code class=\"language-json\">{\n  \"query\": \"machine learning drug discovery\"\n}</code></pre><h3>Biological Use Case</h3><p>Ideal for broad academic literature searches across multiple disciplines related to life sciences. Use cases include: finding highly cited papers in a research area, discovering cross-disciplinary research connections, locating papers not indexed in PubMed, finding theses and dissertations, identifying review articles and book chapters, tracking citations and research impact, and accessing grey literature and conference proceedings. Google Scholar's comprehensive indexing makes it valuable for interdisciplinary research combining biology with chemistry, physics, computer science, or engineering.</p><h3>Output</h3><p>Returns a text file (scholar_results.txt) containing the first search result with detailed information including title, authors, publication year, venue/journal, abstract, citation count, and link to the paper. Results prioritize highly cited and relevant papers.</p><h3>Category</h3><p>literature</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/literature/query_scholar.py --query \"${query}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Input",
      "name": "query",
      "label": "Query",
      "description": "Search query string for scholarly literature",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}