{
  "name": "biomni-analyze-mitochondrial-morphology-and-potential",
  "title": "Biomni: Analyze Mitochondrial Morphology And Potential",
  "description": "Quantifies metrics of mitochondrial morphology and membrane potential from fluorescence microscopy images. Analyzes network connectivity, fragmentation, junction points, and TMRE intensity to assess mitochondrial health and function.",
  "content": "<h3>Overview</h3><p>Quantifies metrics of mitochondrial morphology and membrane potential from fluorescence microscopy images. This tool analyzes mitochondrial network connectivity, fragmentation patterns, junction points, and TMRE (tetramethylrhodamine ethyl ester) intensity to assess mitochondrial health and function. Performs automated image segmentation, skeletonization of mitochondrial networks, and quantitative analysis of both structural and functional parameters critical for understanding cellular bioenergetics and stress responses.</p><h3>Input Parameters</h3><ul><li><strong>morphology_image_path</strong> (string, required): Path to fluorescence microscopy image showing mitochondrial morphology (typically MitoTracker or similar dye). Supported formats include TIFF, PNG, or multi-dimensional microscopy formats.</li><li><strong>potential_image_path</strong> (string, required): Path to fluorescence microscopy image of mitochondrial membrane potential (typically TMRE or JC-1 staining). Should be from the same field of view as morphology image.</li><li><strong>output_dir</strong> (string, optional): Directory path where analysis results, segmentation masks, and quantification plots will be saved. Defaults to \"./output\".</li></ul><h3>Biological Use Case</h3><p>Critical for studying mitochondrial dynamics in response to cellular stress, drug treatments, or disease states. Applications include: assessing mitochondrial dysfunction in neurodegenerative disease models (Parkinson's, Alzheimer's), evaluating mitochondrial fragmentation during apoptosis, screening compounds that affect mitochondrial fission/fusion balance, investigating metabolic reprogramming in cancer cells, and studying aging-related changes in mitochondrial networks. Fragmented networks with low TMRE intensity indicate compromised mitochondrial health, while interconnected networks suggest healthy bioenergetics.</p><h3>Output</h3><p>Returns comprehensive metrics including: (1) morphological features (network branch length, junction density, fragmentation index, mean mitochondrial length), (2) membrane potential measurements (mean TMRE intensity, intensity distribution, depolarized vs. polarized fractions), (3) correlation between morphology and potential, (4) segmentation masks as PNG images, (5) skeleton overlays showing network structure, (6) quantitative plots (histograms, scatter plots), and (7) per-cell or per-region statistics saved as CSV files.</p><h3>Category</h3><p>cell_biology</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/cell_biology/analyze_mitochondrial_morphology_and_potential.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}