{
  "name": "biomni-perform-facs-cell-sorting",
  "title": "Biomni: Perform Facs Cell Sorting",
  "description": "Performs Fluorescence-Activated Cell Sorting (FACS) to enrich cell populations based on fluorescence characteristics. Loads flow cytometry data from FCS files, applies gating thresholds, and exports sorted cell populations with enrichment statistics.",
  "content": "<h3>Overview</h3><p>Performs Fluorescence-Activated Cell Sorting (FACS) simulation to enrich cell populations based on fluorescence characteristics. This tool loads flow cytometry data from FCS files, applies user-defined gating thresholds on specific fluorescence parameters, and exports sorted cell populations with detailed enrichment statistics. Simulates the sorting process by filtering events that fall within specified fluorescence intensity ranges, useful for planning sorting experiments or analyzing hypothetical sorting outcomes from existing data.</p><h3>Input Parameters</h3><ul><li><strong>cell_suspension_data</strong> (string, required): Path to the FCS file containing flow cytometry data of the cell suspension to be sorted. File should include all relevant fluorescence channels and scatter parameters.</li><li><strong>fluorescence_parameter</strong> (string, required): Name of the fluorescence channel to use for sorting decisions (e.g., \"GFP-A\", \"PE-A\", \"APC-Cy7-A\"). Must match a channel name in the FCS file.</li><li><strong>threshold_min</strong> (number, optional): Minimum fluorescence intensity threshold for the sort gate. Events below this value will be excluded from the sorted population.</li><li><strong>threshold_max</strong> (number, optional): Maximum fluorescence intensity threshold for the sort gate. Events above this value will be excluded from the sorted population.</li><li><strong>output_file</strong> (string, optional): Filename for the sorted cell data CSV export. Defaults to \"sorted_cells.csv\".</li></ul><h3>Biological Use Case</h3><p>Essential for isolating pure cell populations for downstream applications. Common uses include: enriching transfected cells expressing fluorescent reporters (GFP+, RFP+) for molecular analysis, purifying specific immune cell subsets for functional assays or RNA-seq, isolating rare cell populations (e.g., stem cells, circulating tumor cells) from heterogeneous samples, separating live from dead cells using viability dyes, and collecting cells at specific cell cycle stages for synchronization studies. The ability to define precise fluorescence windows enables high-purity isolation critical for sensitive downstream assays.</p><h3>Output</h3><p>Returns a JSON report with: (1) total events analyzed and events sorted, (2) sorting efficiency percentage, (3) enrichment fold-change compared to pre-sort population, (4) mean fluorescence intensity of sorted vs. unsorted populations, (5) CSV file containing all sorted events with their parameter values, (6) summary statistics including purity and yield estimates, and (7) optional visualization plots showing pre-sort vs. post-sort distributions.</p><h3>Category</h3><p>cell_biology</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/cell_biology/perform_facs_cell_sorting.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}