{
  "name": "biomni-quantify-and-cluster-cell-motility",
  "title": "Biomni: Quantify And Cluster Cell Motility",
  "description": "Quantify cell motility features from time-lapse microscopy images and cluster cells based on motility patterns. Tracks cells across time frames, calculates speed, directionality, and mean squared displacement, then performs k-means clustering to identify distinct motility patterns.",
  "content": "<h3>Overview</h3><p>Quantify cell motility features from time-lapse microscopy images and cluster cells based on motility patterns. This tool performs automated cell tracking across time frames, calculates comprehensive motility metrics including instantaneous velocity, directionality index, mean squared displacement (MSD), and persistence time, then applies k-means clustering to identify and classify distinct motility phenotypes. Ideal for analyzing cell migration behaviors in wound healing, chemotaxis, or invasion assays.</p><h3>Input Parameters</h3><ul><li><strong>image_sequence_path</strong> (string, required): Path to directory containing time-lapse microscopy images as a sequence, or path to a multi-frame TIFF file. Images should be ordered chronologically and contain clearly visible cell boundaries or nuclei.</li><li><strong>output_dir</strong> (string, optional): Directory path where tracking results, motility metrics, cluster assignments, and trajectory visualizations will be saved. Defaults to \"./results\".</li><li><strong>num_clusters</strong> (integer, optional): Number of distinct motility clusters to identify using k-means clustering. Typically 3-5 clusters capture major motility phenotypes (e.g., stationary, random walk, directional migration). Defaults to 3.</li></ul><h3>Input Format</h3><pre>{\n  \"image_sequence_path\": \"/path/to/timelapse_images/\",\n  \"output_dir\": \"./motility_analysis\",\n  \"num_clusters\": 4\n}</pre><h3>Biological Use Case</h3><p>Critical for understanding cell migration in development, cancer metastasis, and immune responses. Applications include: analyzing neutrophil chemotaxis toward inflammatory signals, studying cancer cell invasion through extracellular matrix, quantifying stem cell migration during development, evaluating drug effects on cell motility in wound healing assays, comparing wild-type vs. mutant phenotypes in migration-defective cell lines, and identifying subpopulations with distinct migratory behaviors in heterogeneous cultures. Clustering reveals whether cells exhibit directed migration (high directionality), random walk (low directionality, high speed), or stationary behavior.</p><h3>Output</h3><p>Returns comprehensive analysis including: (1) per-cell motility metrics (mean speed, maximum speed, total distance traveled, net displacement, directionality ratio, MSD curves), (2) cluster assignments for each tracked cell with cluster centroids, (3) trajectory plots color-coded by cluster, (4) time-series plots showing motility dynamics, (5) statistical comparisons between clusters (speed distributions, directionality boxplots), (6) CSV file with frame-by-frame tracking data, and (7) summary statistics and cluster characteristics report.</p><h3>Category</h3><p>cell_biology</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/cell_biology/quantify_and_cluster_cell_motility.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}