{
  "name": "biomni-quantify-cell-cycle-phases-from-microscopy",
  "title": "Biomni: Quantify Cell Cycle Phases From Microscopy",
  "description": "Quantify the percentage of cells in each cell cycle phase using Calcofluor white stained microscopy images. Processes microscopy images where cell walls/septa are stained with Calcofluor white, segments individual cells, extracts features, and classifies each cell into G1, S, or G2/M phase.",
  "content": "<h3>Overview</h3><p>Quantify the percentage of cells in each cell cycle phase using Calcofluor white stained microscopy images. This tool processes fluorescence microscopy images where cell walls, septa, or DNA are stained with Calcofluor white or similar nuclear dyes, performs automated single-cell segmentation, extracts morphological and intensity features (cell size, shape, nuclear area, DNA content), and classifies each cell into G1, S, or G2/M phase based on these characteristics. Provides population-level cell cycle distribution statistics essential for assessing proliferation rates and cell cycle progression.</p><h3>Input Parameters</h3><ul><li><strong>image_paths</strong> (array of strings, required): List of file paths to microscopy images for analysis. Can process multiple images from different fields of view or experimental conditions. Images should show clear nuclear or septal staining patterns.</li><li><strong>output_dir</strong> (string, optional): Directory path where segmentation results, cell cycle classification data, distribution plots, and statistical summaries will be saved. Defaults to \"./results\".</li></ul><h3>Input Format</h3><pre>{\n  \"image_paths\": [\n    \"/path/to/sample1_calcofluor.tif\",\n    \"/path/to/sample2_calcofluor.tif\",\n    \"/path/to/sample3_calcofluor.tif\"\n  ],\n  \"output_dir\": \"./cell_cycle_analysis\"\n}</pre><h3>Biological Use Case</h3><p>Essential for studying cell proliferation, cell cycle regulation, and drug effects on cell division. Applications include: assessing cell cycle arrest induced by chemotherapy or cell cycle inhibitors, quantifying the proliferative fraction in cancer cell populations, studying cell cycle checkpoint activation in DNA damage response, comparing cell cycle profiles between wild-type and mutant strains, evaluating synchronization efficiency in cell cycle experiments, and monitoring recovery from cell cycle blocks. Budding yeast show characteristic septal patterns (single septum = G1, budding = S/G2, double septum = M phase), while mammalian cells are classified by nuclear DNA content and size.</p><h3>Output</h3><p>Returns detailed analysis including: (1) percentage of cells in each phase (G1, S, G2/M) with confidence intervals, (2) total cell count per image, (3) per-cell classifications with feature measurements (area, perimeter, intensity, eccentricity), (4) histogram showing cell cycle phase distribution, (5) segmentation overlays with phase-specific color coding, (6) CSV file with single-cell data for all analyzed cells, (7) statistical comparison between images or conditions if multiple inputs provided, and (8) quality control metrics (segmentation accuracy, classification confidence scores).</p><h3>Category</h3><p>cell_biology</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/cell_biology/quantify_cell_cycle_phases_from_microscopy.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}