{
  "name": "biomni-segment-and-quantify-cells-in-multiplexed-images",
  "title": "Biomni: Segment And Quantify Cells In Multiplexed Images",
  "description": "Segment cells and quantify protein expression levels from multichannel tissue images.",
  "content": "<h3>Overview</h3><p>This pathology analysis tool performs automated cell segmentation and quantitative protein expression analysis from multiplexed immunofluorescence or immunohistochemistry tissue images. The tool processes multichannel images to identify individual cells, quantify marker expression intensity, perform cell phenotyping, and analyze spatial relationships between different cell populations in tissue microenvironments.</p><h3>Input Parameters</h3><ul><li><strong>image_path</strong> (required): Path to the multiplexed multichannel tissue image file</li><li><strong>markers_list</strong> (required): List of protein markers/antibodies used in each channel (e.g., ['DAPI', 'CD3', 'CD8', 'PD-1'])</li><li><strong>nuclear_channel_index</strong> (optional): Index of the nuclear staining channel for cell segmentation (default: 0)</li><li><strong>output_dir</strong> (optional): Directory where analysis results will be saved (default: './output')</li></ul><h3>Biological Use Case</h3><p>Multiplexed tissue imaging is transformative for cancer immunology, enabling detailed characterization of tumor immune microenvironments. This tool is essential for identifying immune cell infiltration patterns, quantifying checkpoint protein expression (PD-1, PD-L1, CTLA-4), phenotyping T cell subsets, analyzing tumor-immune interactions, and predicting immunotherapy responses. Applications include biomarker discovery for precision oncology, spatial analysis of tertiary lymphoid structures, investigation of immune exclusion mechanisms, and monitoring treatment-induced changes in the tumor microenvironment across various cancer types.</p><h3>Output</h3><p>The analysis generates single-cell data including cell coordinates, phenotype classifications, marker expression intensities for each protein, cell morphology parameters, and spatial statistics. Results include cell density heatmaps, phenotype distribution charts, spatial neighborhood analysis, marker co-expression patterns, and exportable single-cell data matrices for downstream machine learning and statistical analysis.</p><h3>Category</h3><p>pathology</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/pathology/segment_and_quantify_cells_in_multiplexed_images.py \"${image_path}\" \"${markers_list}\" --nuclear-channel-index \"${nuclear_channel_index}\" --output-dir \"${output_dir}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "image_path",
      "label": "Image Path",
      "description": "Path to the multiplexed multichannel tissue image file",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Input",
      "name": "markers_list",
      "label": "Markers List",
      "description": "JSON string or file path defining list of protein markers/antibodies used in each channel (e.g., [\"DAPI\", \"CD3\", \"CD8\", \"CD45\", \"PD-L1\"])",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Input",
      "name": "nuclear_channel_index",
      "label": "Nuclear Channel Index",
      "description": "Index of the nuclear staining channel for cell segmentation (default: 0)",
      "defaultValue": "0",
      "required": false
    },
    {
      "type": "Input",
      "name": "output_dir",
      "label": "Output Directory",
      "description": "Directory where analysis results will be saved (default: ./output)",
      "defaultValue": "./output",
      "required": false
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}