{
  "name": "biomni-analyze-circular-dichroism-spectra",
  "title": "Biomni: Analyze Circular Dichroism Spectra",
  "description": "Analyzes circular dichroism (CD) spectroscopy data to determine secondary structure and thermal stability.",
  "content": "<h3>Overview</h3><p>Circular dichroism (CD) spectroscopy is a powerful technique for analyzing protein secondary structure content and thermal stability. This tool processes CD spectroscopy data across wavelength ranges (typically 190-260 nm for far-UV CD) to quantify alpha-helix, beta-sheet, and random coil content. It can also analyze thermal denaturation curves by monitoring CD signal changes across temperature ranges, providing insights into protein folding stability and cooperative unfolding transitions.</p><h3>Input Parameters</h3><p>Each parameter is provided as an individual input field:</p><ul><li><strong>sample_name</strong> (string, required): Identifier for the protein or sample being analyzed</li><li><strong>sample_type</strong> (string, required): Type of sample (e.g., \"protein\", \"peptide\", \"DNA\", \"RNA\")</li><li><strong>wavelength_data</strong> (comma-separated numbers, required): Wavelength values in nanometers for CD measurements</li><li><strong>cd_signal_data</strong> (comma-separated numbers, required): CD signal values corresponding to each wavelength (in mdeg or molar ellipticity)</li><li><strong>temperature_data</strong> (comma-separated numbers, optional): Temperature values in Kelvin for thermal denaturation experiments</li><li><strong>thermal_cd_data</strong> (comma-separated numbers, optional): CD signal values at a specific wavelength across different temperatures</li></ul><h3>Biological Use Case</h3><p>Researchers use CD spectroscopy to characterize protein structure and stability in drug discovery, protein engineering, and biophysics studies. This tool enables quantitative analysis of secondary structure composition, allowing scientists to verify proper protein folding after expression and purification, assess the impact of mutations on protein structure, evaluate buffer conditions for protein stability, measure binding-induced conformational changes, and determine thermal melting temperatures (Tm) to assess protein thermostability. CD spectroscopy is particularly valuable for quality control in biotherapeutic development and for understanding structure-function relationships in proteins.</p><h3>Output</h3><p>The analysis produces JSON output containing secondary structure percentages (alpha-helix, beta-sheet, random coil), structural classification, thermal stability parameters including melting temperature (Tm) if temperature data is provided, and statistical quality metrics. Visualization plots may include CD spectrum curves and thermal denaturation curves showing unfolding transitions.</p><h3>Category</h3><p>biochemistry</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/biochemistry/analyze_circular_dichroism_spectra.py --sample_name \"${sample_name}\" --sample_type \"${sample_type}\" --wavelength_data \"${wavelength_data}\" --cd_signal_data \"${cd_signal_data}\" --temperature_data \"${temperature_data}\" --thermal_cd_data \"${thermal_cd_data}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Input",
      "name": "sample_name",
      "label": "Sample Name",
      "description": "Identifier for the protein or sample being analyzed",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Input",
      "name": "sample_type",
      "label": "Sample Type",
      "description": "Type of sample (e.g., protein, peptide, DNA, RNA)",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Input",
      "name": "wavelength_data",
      "label": "Wavelength Data",
      "description": "Wavelength values in nanometers (comma-separated)",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Input",
      "name": "cd_signal_data",
      "label": "CD Signal Data",
      "description": "CD signal values corresponding to each wavelength (comma-separated)",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Input",
      "name": "temperature_data",
      "label": "Temperature Data (Optional)",
      "description": "Temperature values in Kelvin for thermal denaturation (comma-separated)",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Input",
      "name": "thermal_cd_data",
      "label": "Thermal CD Data (Optional)",
      "description": "CD signal values at specific wavelength across temperatures (comma-separated)",
      "defaultValue": "",
      "required": false
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}