{
  "name": "biomni-analyze-itc-binding-thermodynamics",
  "title": "Biomni: Analyze Itc Binding Thermodynamics",
  "description": "Analyzes isothermal titration calorimetry (ITC) data to determine binding affinity and thermodynamic parameters.",
  "content": "<h3>Overview</h3><p>Isothermal titration calorimetry (ITC) is the gold standard technique for measuring biomolecular binding interactions in solution. This tool analyzes ITC experimental data to extract complete thermodynamic profiles of binding events, including binding affinity (Kd or Ka), stoichiometry (n), enthalpy change (ΔH), entropy change (ΔS), and Gibbs free energy (ΔG). By measuring the heat released or absorbed during titration of a ligand into a protein solution, ITC provides label-free, direct measurement of binding energetics. The tool fits binding isotherms to appropriate models (single-site, multiple-site, cooperative) and determines whether binding is enthalpically or entropically driven.</p><h3>Input Parameters</h3><ul><li><strong>itc_data_path</strong> (string, optional): Path to ITC data file from instrument (vendor-specific format)</li><li><strong>itc_data</strong> (object, optional): Raw ITC data including injection volumes, heat signals, and timestamps as key-value pairs</li><li><strong>temperature</strong> (number, optional): Experimental temperature in Kelvin (default: 298.15 K / 25°C)</li><li><strong>protein_concentration</strong> (number, optional): Concentration of protein in the cell (in μM)</li><li><strong>ligand_concentration</strong> (number, optional): Concentration of ligand in the syringe (in μM)</li></ul><h3>Input Format</h3><pre>{\n  \"itc_data\": {\n    \"injection_volumes\": [0.5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2],\n    \"heat_per_injection\": [-0.02, -2.15, -3.85, -4.92, -5.45, -5.23, -4.67, -3.89, -3.05, -2.28, -1.67, -1.18, -0.79, -0.51, -0.32],\n    \"time_points\": [0, 180, 360, 540, 720, 900, 1080, 1260, 1440, 1620, 1800, 1980, 2160, 2340, 2520]\n  },\n  \"temperature\": 298.15,\n  \"protein_concentration\": 20,\n  \"ligand_concentration\": 300\n}</pre><h3>Biological Use Case</h3><p>ITC is indispensable in drug discovery, structural biology, and biophysical characterization of molecular interactions. Researchers use this tool to characterize drug-target binding affinity and thermodynamics for lead optimization, validate hits from screening campaigns with direct binding measurements, understand protein-protein, protein-nucleic acid, and protein-lipid interactions, dissect the energetic contributions of specific amino acids through mutagenesis studies, optimize binding conditions and formulation for therapeutic development, and distinguish between different binding modes. The thermodynamic signature (ΔH and ΔS) provides insights into the nature of interactions (hydrogen bonds, hydrophobic effects, conformational changes) that are crucial for rational drug design and understanding biological recognition.</p><h3>Output</h3><p>The tool generates comprehensive JSON output containing thermodynamic parameters (Kd, Ka, n, ΔH, ΔS, ΔG), binding model classification, fitted isotherm data points, statistical quality metrics (chi-squared, fitting errors), and c-value assessment for experimental design quality. Visualization outputs include binding isotherm plots showing heat per injection versus molar ratio, and integrated heat plots with fitted binding curves.</p><h3>Category</h3><p>biochemistry</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/biochemistry/analyze_itc_binding_thermodynamics.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}