{
  "name": "biomni-analyze-enzyme-kinetics-assay",
  "title": "Biomni: Analyze Enzyme Kinetics Assay",
  "description": "Performs in vitro enzyme kinetics assay and analyzes the dose-dependent effects of modulators.",
  "content": "<h3>Overview</h3><p>This tool performs comprehensive in vitro enzyme kinetics analysis using Michaelis-Menten kinetics principles. It processes experimental data from enzyme assays to determine fundamental kinetic parameters including Km (Michaelis constant), Vmax (maximum reaction velocity), kcat (turnover number), and catalytic efficiency (kcat/Km). The tool also evaluates the dose-dependent effects of enzyme modulators (inhibitors or activators), characterizing their potency (IC50/EC50), mechanism of action (competitive, non-competitive, uncompetitive), and Hill coefficients for cooperative binding.</p><h3>Input Parameters</h3><ul><li><strong>enzyme_name</strong> (string, required): Name or identifier of the enzyme being studied</li><li><strong>substrate_concentrations</strong> (array of numbers, required): Substrate concentration values in micromolar (μM) or millimolar (mM)</li><li><strong>enzyme_concentration</strong> (number, required): Concentration of enzyme used in the assay (in nM or μM)</li><li><strong>modulators</strong> (object, optional): Information about inhibitors or activators being tested, including compound names and concentration ranges</li><li><strong>time_points</strong> (array of numbers, optional): Time points in seconds or minutes for progress curve analysis</li><li><strong>output_dir</strong> (string, optional): Directory path for output files (default: \"./\")</li></ul><h3>Biological Use Case</h3><p>Enzyme kinetics analysis is fundamental to drug discovery, biochemistry research, and metabolic engineering. Researchers use this tool to characterize enzyme mechanisms and efficiency in metabolic pathways, screen and validate enzyme inhibitors as potential drug candidates, optimize biocatalysts for industrial applications, understand disease-associated enzyme dysfunction, and evaluate the selectivity and potency of compounds targeting specific enzymes. This is particularly critical in developing therapeutics for cancer (kinase inhibitors), infectious diseases (protease inhibitors), and metabolic disorders (enzyme replacement therapies). The kinetic parameters obtained guide lead optimization and predict in vivo drug efficacy.</p><h3>Output</h3><p>The analysis generates JSON output containing kinetic parameters (Km, Vmax, kcat, kcat/Km), modulator characterization (IC50/EC50, Hill coefficient, inhibition mechanism), statistical metrics (R-squared, standard errors), and quality control flags. Visualization outputs include Michaelis-Menten plots, Lineweaver-Burk plots for inhibition mechanism determination, dose-response curves for modulators, and progress curves showing reaction time courses.</p><h3>Category</h3><p>biochemistry</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/biochemistry/analyze_enzyme_kinetics_assay.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}