{
  "name": "biomni-analyze-protease-kinetics",
  "title": "Biomni: Analyze Protease Kinetics",
  "description": "Analyze protease kinetics data from fluorogenic peptide cleavage assays.",
  "content": "<h3>Overview</h3><p>This tool analyzes protease enzyme kinetics using fluorogenic peptide substrate cleavage assays. Proteases are critical enzymes involved in numerous biological processes including blood coagulation, immune response, apoptosis, and viral replication. This analysis measures fluorescence increase over time as fluorogenic peptide substrates are cleaved, revealing the catalytic efficiency of proteases. The tool determines Michaelis-Menten parameters (Km, Vmax, kcat) specific to protease-substrate pairs, evaluates substrate specificity profiles, and assesses the effects of protease inhibitors. Time-course fluorescence data across multiple substrate concentrations are fitted to kinetic models to extract quantitative parameters describing protease activity.</p><h3>Input Parameters</h3><ul><li><strong>time_points</strong> (array of numbers, required): Time points in seconds or minutes when fluorescence readings were taken</li><li><strong>fluorescence_data</strong> (array of arrays, required): Fluorescence intensity values for each substrate concentration at each time point</li><li><strong>substrate_concentrations</strong> (array of numbers, required): Concentrations of fluorogenic peptide substrate tested (in μM)</li><li><strong>enzyme_concentration</strong> (number, required): Concentration of protease enzyme used in the assay (in nM)</li><li><strong>output_prefix</strong> (string, optional): Prefix for output file names (default: \"protease_kinetics\")</li><li><strong>output_dir</strong> (string, optional): Directory path for output files (default: \"./\")</li></ul><h3>Input Format</h3><pre>{\n  \"time_points\": [0, 60, 120, 180, 240, 300, 360, 420, 480],\n  \"fluorescence_data\": [\n    [100, 150, 220, 310, 415, 535, 665, 805, 950],\n    [100, 180, 295, 445, 625, 835, 1070, 1325, 1595],\n    [100, 205, 360, 565, 810, 1090, 1395, 1720, 2060]\n  ],\n  \"substrate_concentrations\": [10, 25, 50],\n  \"enzyme_concentration\": 5,\n  \"output_prefix\": \"caspase3_kinetics\",\n  \"output_dir\": \"./protease_analysis/\"\n}</pre><h3>Biological Use Case</h3><p>Protease kinetics analysis is essential for drug discovery targeting proteases involved in disease, including cancer (matrix metalloproteinases, caspases), infectious diseases (HIV protease, HCV NS3 protease, coronavirus main protease), inflammation (ADAM family proteases), and neurodegenerative disorders (beta-secretase). Researchers use this tool to characterize protease substrate preferences and cleavage efficiency, screen and optimize protease inhibitors as therapeutic candidates, understand protease activation cascades in signaling pathways, engineer proteases with altered substrate specificity for biotechnology applications, and evaluate the selectivity of compounds across protease families. Fluorogenic substrates provide real-time, continuous monitoring of protease activity with high sensitivity, making this approach ideal for high-throughput screening and detailed mechanistic studies.</p><h3>Output</h3><p>The analysis generates JSON output containing kinetic parameters (Km, Vmax, kcat, catalytic efficiency kcat/Km), initial velocity calculations for each substrate concentration, curve fitting quality metrics (R-squared values), and flags for potential substrate inhibition or activation. Visualization outputs include progress curves showing fluorescence vs time for each substrate concentration, Michaelis-Menten plots of velocity vs substrate concentration, Lineweaver-Burk double reciprocal plots, and Eadie-Hofstee plots for comprehensive kinetic characterization.</p><h3>Category</h3><p>biochemistry</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/biochemistry/analyze_protease_kinetics.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}