{
  "name": "biomni-analyze-protein-conservation",
  "title": "Biomni: Analyze Protein Conservation",
  "description": "Perform multiple sequence alignment and phylogenetic analysis to identify conserved protein regions.",
  "content": "<h3>Overview</h3><p>This tool performs comprehensive protein sequence conservation analysis through multiple sequence alignment (MSA) and phylogenetic methods. Sequence conservation analysis identifies evolutionarily conserved residues and regions in proteins, which typically indicate functionally important sites such as active sites, binding pockets, structural motifs, or protein-protein interaction interfaces. The tool aligns homologous protein sequences, calculates position-specific conservation scores using information-theoretic measures (Shannon entropy, Jensen-Shannon divergence), identifies conserved motifs and functional domains, and generates phylogenetic relationships to trace evolutionary history. Conservation patterns reveal residues critical for protein function that are maintained across species due to selective pressure.</p><h3>Input Parameters</h3><ul><li><strong>protein_sequences</strong> (object or array, required): Collection of protein sequences in FASTA format or as key-value pairs with sequence identifiers and amino acid sequences</li><li><strong>output_dir</strong> (string, optional): Directory path for output files (default: \"./\")</li></ul><h3>Biological Use Case</h3><p>Protein conservation analysis is fundamental to understanding protein evolution, structure, and function across diverse research applications. Scientists use this tool to identify functionally critical residues for site-directed mutagenesis studies, predict potential active sites and catalytic residues in uncharacterized enzymes, guide rational protein engineering by preserving essential residues while modifying others, identify therapeutic target sites that are conserved in pathogens but divergent from human proteins, understand disease mechanisms by analyzing conservation of disease-associated mutations, prioritize residues for structural biology studies (crystallography, NMR), trace evolutionary relationships and functional divergence in protein families, and validate computational predictions of functional sites. Conservation analysis is particularly valuable in drug discovery for identifying druggable pockets and understanding resistance mechanisms.</p><h3>Output</h3><p>The analysis produces JSON output containing per-residue conservation scores, multiple sequence alignment results, identification of conserved motifs and domains, phylogenetic tree data showing evolutionary relationships, statistical significance measures for conservation, and annotations of functionally important regions. Visualization outputs include conservation plots showing score profiles along the sequence, aligned sequences with color-coded conservation levels, phylogenetic trees illustrating species relationships, and structure-conservation mapping if structural data is available.</p><h3>Category</h3><p>biochemistry</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/biochemistry/analyze_protein_conservation.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}