{
  "name": "biomni-analyze-rna-secondary-structure-features",
  "title": "Biomni: Analyze RNA Secondary Structure Features",
  "description": "Calculate numeric values for various structural features of an RNA secondary structure.",
  "content": "<h3>Overview</h3><p>This tool performs comprehensive quantitative analysis of RNA secondary structure features using dot-bracket notation as input. RNA secondary structure, formed by intramolecular base pairing, is critical for RNA function in diverse cellular processes including translation (rRNA, tRNA), splicing (snRNA), gene regulation (riboswitches, miRNA), and catalysis (ribozymes). The tool calculates structural metrics including the number and types of stems, loops (hairpin, internal, bulge, multi-branch), base pair counts (Watson-Crick vs wobble pairs), stacking energies, structural complexity measures, and thermodynamic stability indicators. These quantitative features enable systematic comparison of RNA structures and correlation with functional properties.</p><h3>Input Parameters</h3><p>Each parameter is provided as an individual input field:</p><ul><li><strong>dot_bracket_structure</strong> (string, required): RNA secondary structure in dot-bracket notation where '(' and ')' represent base pairs, '.' represents unpaired bases, and matched parentheses indicate paired positions</li><li><strong>sequence</strong> (string, optional): RNA nucleotide sequence (A, U, G, C) corresponding to the structure for enhanced analysis including GC content, base pair type identification, and energy calculations</li></ul><h3>Biological Use Case</h3><p>RNA structure analysis is essential for understanding RNA biology and engineering functional RNAs for therapeutic and biotechnology applications. Researchers use this tool to characterize regulatory RNA structures in UTRs and understand post-transcriptional gene regulation, design and optimize synthetic riboswitches for metabolic engineering and biosensing, predict the impact of mutations on RNA structure stability in disease contexts, engineer RNA vaccines and therapeutics with desired stability profiles, identify structural motifs for RNA-protein interaction sites, optimize guide RNA design for CRISPR applications, analyze ribozyme catalytic cores and engineer improved catalytic activities, and validate RNA structure predictions from computational folding algorithms. Understanding RNA structural features is crucial for rational RNA design in synthetic biology and for interpreting how genetic variants affect RNA function and disease.</p><h3>Output</h3><p>The tool generates JSON output containing detailed structural metrics including total number of base pairs, stem counts and lengths, loop classifications (hairpin loops, internal loops, bulges, multi-branch loops) with size distributions, structural complexity measures (branching index, entropy), GC content in paired and unpaired regions if sequence is provided, estimated folding free energy, and structural motif identification. Additional metrics include average stem length, maximum stem length, loop-to-stem ratios, and structural symmetry measures useful for comparative analysis.</p><h3>Category</h3><p>biochemistry</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/biochemistry/analyze_rna_secondary_structure_features.py --dot_bracket_structure \"${dot_bracket_structure}\" --sequence \"${sequence}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Input",
      "name": "dot_bracket_structure",
      "label": "Dot-Bracket Structure",
      "description": "RNA secondary structure in dot-bracket notation",
      "defaultValue": "",
      "required": true
    },
    {
      "type": "Input",
      "name": "sequence",
      "label": "RNA Sequence (Optional)",
      "description": "RNA nucleotide sequence (A, U, G, C) corresponding to the structure",
      "defaultValue": "",
      "required": false
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}