{
  "name": "biomni-calculate-similarity-metrics",
  "title": "Biomni: Calculate Similarity Metrics",
  "description": "Calculate similarity metrics between two medical images",
  "content": "<h3>Overview</h3><p>Quantitative assessment of image similarity is crucial for evaluating registration quality, treatment response, and temporal changes in medical imaging. This tool computes multiple similarity metrics between two medical images, including mutual information, normalized cross-correlation, mean squared error, and structural similarity index (SSIM). These metrics provide objective measures of image alignment and correspondence, essential for validating image processing workflows and comparing different registration algorithms.</p><h3>Input Parameters</h3><ul><li><strong>image1_path</strong> (string, required): Path to the first medical image file in NIfTI format (.nii or .nii.gz)</li><li><strong>image2_path</strong> (string, required): Path to the second medical image file in NIfTI format (.nii or .nii.gz) to compare against the first image</li></ul><h3>Input Format</h3><pre>{\n  \"image1_path\": \"/path/to/reference_image.nii.gz\",\n  \"image2_path\": \"/path/to/comparison_image.nii.gz\"\n}</pre><h3>Biological Use Case</h3><p>Similarity metrics are essential for quality control in longitudinal imaging studies where scan consistency must be verified across time points. In registration validation, these metrics quantify how well two images are aligned after spatial transformation. For treatment monitoring in oncology, they help identify regions of change by measuring pre- and post-treatment image similarity. In multi-modal fusion studies, they assess the quality of alignment between different imaging modalities (e.g., MRI and PET). Researchers use these metrics to optimize registration parameters, validate preprocessing pipelines, and detect artifacts or motion-related image degradation.</p><h3>Output</h3><p>Returns a JSON file (similarity_metrics.json) containing computed similarity metrics: mutual information (measures statistical dependence), normalized cross-correlation (assesses linear correlation), mean squared error (quantifies pixel-wise differences), and structural similarity index (evaluates perceptual similarity). Higher mutual information and correlation values indicate better alignment, while lower MSE values indicate more similar intensities. These metrics enable objective comparison of image pairs and validation of image processing quality.</p><h3>Category</h3><p>bioimaging</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/bioimaging/calculate_similarity_metrics.py --image1_path \"${image1_path}\" --image2_path \"${image2_path}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "image1_path",
      "label": "Image 1 Path",
      "description": "Path to the first medical image file in NIfTI format",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "image2_path",
      "label": "Image 2 Path",
      "description": "Path to the second medical image file in NIfTI format",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}