{
  "name": "biomni-analyze-cell-migration-metrics",
  "title": "Biomni: Analyze Cell Migration Metrics",
  "description": "Analyze cell migration metrics from time-lapse microscopy images",
  "content": "<h3>Overview</h3><p>This tool performs quantitative analysis of cell migration dynamics from time-lapse microscopy image sequences. Cell migration is fundamental to many biological processes including development, wound healing, immune response, and cancer metastasis. The analysis tracks individual cells across frames, computes trajectories, and calculates key migration metrics such as instantaneous velocity, accumulated distance, displacement, directionality, mean squared displacement (MSD), and persistence time.</p><h3>Input Parameters</h3><ul><li><strong>image_sequence_path</strong> (string, required): Path to directory containing time-lapse microscopy images or path to a multi-frame TIFF file showing cells over time.</li><li><strong>pixel_size_um</strong> (float, optional): Physical size of each pixel in micrometers for spatial calibration. Default: 1.0 um/pixel.</li><li><strong>time_interval_min</strong> (float, optional): Time interval between consecutive frames in minutes for temporal calibration. Default: 1.0 min.</li><li><strong>min_track_length</strong> (integer, optional): Minimum number of frames a cell must be tracked to be included in analysis. Filters out short, unreliable tracks. Default: 10 frames.</li></ul><h3>Input Format</h3><p>Create a JSON file with the following structure:</p><pre>{\n  \"image_sequence_path\": \"/path/to/timelapse_images/\",\n  \"pixel_size_um\": 0.65,\n  \"time_interval_min\": 5.0,\n  \"min_track_length\": 20\n}</pre><h3>Biological Use Case</h3><p>Cell migration analysis is critical for studying cellular behavior in various contexts. In cancer research, it helps assess the metastatic potential of tumor cells and evaluate anti-metastatic drug candidates. In developmental biology, it characterizes morphogenetic movements and cell sorting during embryogenesis. In immunology, it quantifies leukocyte chemotaxis toward infection sites or inflammation. In wound healing studies, it measures the efficiency of fibroblast or keratinocyte migration into damaged tissue. The tool can distinguish between random migration, directed migration (chemotaxis), and collective cell migration, providing insights into the molecular mechanisms governing cell motility, cytoskeletal dynamics, and cell-substrate interactions.</p><h3>Output</h3><p>The analysis produces cell_migration_results.txt containing: (1) summary statistics for all tracked cells including mean velocity, total distance, net displacement, and directionality ratio, (2) individual cell trajectories with coordinates and timestamps, (3) velocity distributions and temporal dynamics, (4) mean squared displacement analysis for diffusion coefficient calculation, (5) rose plots showing directional preferences, and (6) trajectory visualizations overlaid on representative microscopy images saved as PNG files.</p><h3>Category</h3><p>bioengineering</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/bioengineering/analyze_cell_migration_metrics.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}