{
  "name": "biomni-analyze-in-vitro-drug-release-kinetics",
  "title": "Biomni: Analyze In Vitro Drug Release Kinetics",
  "description": "Analyze in vitro drug release kinetics from biomaterial formulations",
  "content": "<h3>Overview</h3><p>This tool analyzes in vitro drug release kinetics from biomaterial-based delivery systems. Drug delivery systems such as hydrogels, nanoparticles, microspheres, and implants are designed to release therapeutic agents in a controlled manner. The analysis fits experimental release data to multiple mathematical models (zero-order, first-order, Higuchi, Korsmeyer-Peppas, Hixson-Crowell) to characterize release mechanisms, determine rate constants, calculate half-life, and predict long-term release profiles.</p><h3>Input Parameters</h3><ul><li><strong>time_points</strong> (array of floats, required): Time points at which drug concentration measurements were taken, typically in hours. Must be a list of numerical values in chronological order.</li><li><strong>concentration_data</strong> (array of floats, required): Measured drug concentrations at corresponding time points. Can be in units of ug/mL, percentage released, or cumulative amount. Must have the same length as time_points.</li><li><strong>drug_name</strong> (string, optional): Name of the drug being released for labeling purposes. Default: \"Drug\".</li><li><strong>total_drug_loaded</strong> (float, optional): Total amount of drug initially loaded in the delivery system. If provided, enables calculation of release percentage and efficiency. Units should match concentration_data.</li></ul><h3>Input Format</h3><p>Create a JSON file with the following structure:</p><pre>{\n  \"time_points\": [0, 1, 2, 4, 6, 12, 24, 48, 72, 96, 120],\n  \"concentration_data\": [0, 15.2, 28.5, 45.3, 58.7, 75.2, 82.5, 88.3, 91.2, 93.5, 94.8],\n  \"drug_name\": \"Doxorubicin\",\n  \"total_drug_loaded\": 100.0\n}</pre><h3>Biological Use Case</h3><p>Controlled drug delivery is crucial in bioengineering and pharmaceutical sciences for improving therapeutic efficacy while minimizing side effects. This tool is essential for characterizing drug-eluting stents for cardiovascular applications, evaluating sustained-release formulations for cancer chemotherapy, analyzing antibiotic release from bone cement for infection prevention, studying growth factor delivery from tissue engineering scaffolds, and optimizing transdermal patch formulations. By fitting release data to kinetic models, researchers can identify whether release is diffusion-controlled, erosion-controlled, or follows a combination mechanism. This information guides formulation optimization, predicts in vivo performance, supports regulatory submissions, and enables rational design of next-generation delivery systems with desired temporal release profiles.</p><h3>Output</h3><p>The analysis generates drug_release_kinetics_results.txt containing: (1) fitted parameters for all kinetic models with R-squared values indicating goodness of fit, (2) identification of the best-fit model based on statistical criteria, (3) calculated release rate constants and half-life, (4) cumulative release percentage and efficiency metrics, (5) predicted release profiles for extended time periods, and (6) publication-quality plots showing experimental data with fitted curves for each model, residual analysis, and comparative model performance saved as PNG files.</p><h3>Category</h3><p>bioengineering</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/bioengineering/analyze_in_vitro_drug_release_kinetics.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}