{
  "name": "biomni-perform-crispr-cas9-genome-editing",
  "title": "Biomni: Perform CRISPR Cas9 Genome Editing",
  "description": "Simulate CRISPR-Cas9 genome editing including guide RNA design, delivery, and analysis",
  "content": "<h3>Overview</h3><p>This tool simulates the CRISPR-Cas9 genome editing process for experimental design and analysis. CRISPR-Cas9 is a revolutionary gene editing technology that enables precise, targeted modifications to DNA sequences in living cells. The simulation evaluates guide RNA (gRNA) sequences for specificity and efficiency, predicts on-target cutting sites, identifies potential off-target effects, estimates editing efficiency based on sequence context, and provides recommendations for optimal experimental design. This computational approach helps researchers plan CRISPR experiments before costly laboratory work.</p><h3>Input Parameters</h3><ul><li><strong>guide_rna_sequences</strong> (array of strings, required): List of guide RNA sequences (typically 20 nucleotides) to evaluate. Should be DNA sequences using A, T, G, C nucleotides. Multiple gRNAs can be provided for multiplexed editing or to compare alternative designs.</li><li><strong>target_genomic_loci</strong> (string, required): Target genomic DNA sequence containing the region of interest. Should include the target site plus flanking sequences (recommended 200-500 bp total) to enable off-target analysis. Use genomic DNA sequence (not mRNA).</li><li><strong>cell_tissue_type</strong> (string, required): Cell or tissue type for the experiment (e.g., \"HEK293\", \"primary hepatocytes\", \"mouse embryonic stem cells\", \"T cells\"). This parameter influences editing efficiency predictions and delivery method recommendations based on cell-type-specific factors.</li></ul><h3>Biological Use Case</h3><p>CRISPR-Cas9 genome editing has transformed biological research and therapeutic development. This tool supports diverse applications including: (1) Gene knockout studies - disrupting genes to understand their function in disease models or cellular processes, (2) Gene correction - repairing disease-causing mutations for therapeutic purposes (e.g., sickle cell disease, cystic fibrosis), (3) Knock-in experiments - inserting fluorescent tags, epitope tags, or regulatory elements at specific genomic locations, (4) Creating cell lines and animal models with defined genetic modifications, (5) CAR-T cell engineering - editing immune cells for cancer immunotherapy, and (6) Agricultural biotechnology - improving crop traits or disease resistance. The simulation helps optimize gRNA selection to maximize on-target activity while minimizing off-target mutations that could cause unintended genomic changes. This is critical for both research accuracy and therapeutic safety.</p><h3>Output</h3><p>The simulation produces crispr_cas9_results.txt containing: (1) gRNA quality scores and rankings based on predicted editing efficiency, GC content, and secondary structure, (2) identification of PAM sequences (NGG motifs) and precise cut sites 3 bp upstream of PAM, (3) comprehensive off-target analysis showing potential binding sites elsewhere in the genome with mismatch counts and risk scores, (4) sequence context analysis including microhomology regions that might affect repair outcomes, (5) delivery method recommendations (viral vectors, electroporation, lipofection) appropriate for the specified cell type, (6) predicted editing outcomes including frequency of non-homologous end joining (NHEJ) vs. homology-directed repair (HDR), and (7) experimental design suggestions for validation including primer sequences for genotyping and recommended controls.</p><h3>Category</h3><p>bioengineering</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/bioengineering/perform_crispr_cas9_genome_editing.py \"${inputFile}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "inputFile",
      "label": "Input File",
      "description": "Input file from stash (JSON format)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    }
  ]
}