{
  "name": "biomni-analyze-cell-senescence-and-apoptosis",
  "title": "Biomni: Analyze Cell Senescence And Apoptosis",
  "description": "Analyze flow cytometry data to quantify senescent and apoptotic cell populations. Processes FCS files containing measurements for senescence-associated β-galactosidase (SA-β-Gal) and Annexin V/7-AAD staining.",
  "content": "<h3>Overview</h3><p>Analyze flow cytometry data to quantify senescent and apoptotic cell populations in cancer research. Processes FCS (Flow Cytometry Standard) files containing measurements for senescence-associated β-galactosidase (SA-β-Gal) and Annexin V/7-AAD staining. This tool provides quantitative assessment of cellular stress responses critical for understanding cancer progression, therapy resistance, and aging-related pathologies.</p><h3>Input Parameters</h3><ul><li><strong>fcs_file_path</strong> (string, required): Path to the FCS file containing flow cytometry data with SA-β-Gal and Annexin V/7-AAD measurements</li></ul><h3>Input Format</h3><p>JSON file with the following structure:</p><pre>{\n  \"fcs_file_path\": \"/path/to/sample.fcs\"\n}</pre><h3>Biological Use Case</h3><p>In cancer biology, cellular senescence and apoptosis are critical mechanisms that regulate tumor suppression and response to chemotherapy. Senescent cells accumulate in tumors and the tumor microenvironment, secreting factors that can promote or suppress cancer progression (the senescence-associated secretory phenotype, SASP). Apoptosis resistance is a hallmark of cancer cells. This tool enables researchers to:</p><ul><li>Quantify senescent cell populations using SA-β-Gal activity measurements</li><li>Distinguish early apoptotic (Annexin V+/7-AAD-), late apoptotic (Annexin V+/7-AAD+), and necrotic cells</li><li>Evaluate therapeutic efficacy by measuring cell death induction</li><li>Study therapy-induced senescence in cancer treatment</li><li>Investigate aging-associated changes in pre-malignant and malignant tissues</li></ul><h3>Output</h3><p>Text file (senescence_apoptosis_results.txt) containing quantitative analysis of cell populations including percentages of senescent cells, early apoptotic cells, late apoptotic cells, and viable cells from the flow cytometry data.</p><h3>Category</h3><p>cancer_biology</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/cancer_biology/analyze_cell_senescence_and_apoptosis.py \"${fcsFilePath}\" -o \"${outputDir}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "fcsFilePath",
      "label": "FCS File",
      "description": "Upload the FCS file containing flow cytometry data with SA-β-Gal and Annexin V/7-AAD measurements",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Select or create a stash folder where the results will be saved",
      "defaultValue": "./"
    }
  ]
}