{
  "name": "biomni-analyze-tissue-deformation-flow",
  "title": "Biomni: Analyze Tissue Deformation Flow",
  "description": "Quantify tissue deformation and flow dynamics from microscopy image sequence.",
  "content": "<h3>Overview</h3><p>This tool quantifies tissue deformation and flow dynamics from time-lapse microscopy image sequences. It uses optical flow algorithms and particle image velocimetry (PIV) techniques to track cellular movements, compute velocity fields, strain rates, and deformation patterns over time. The analysis reveals collective cell behaviors, tissue-scale mechanical responses, and spatial coordination during morphogenesis, wound healing, or tumor invasion. Results provide insights into the biomechanical forces and cellular rearrangements that drive tissue remodeling.</p><h3>Input Parameters</h3><ul><li><strong>image_sequence</strong> (string or array, required): Path to time-lapse microscopy images. Can be either a glob pattern (e.g., \"/path/to/images/*.tif\") matching multiple time points, a directory path containing sequential images, or an array of image file paths in temporal order. Images should capture the same tissue region over multiple time points.</li><li><strong>pixel_scale</strong> (float, optional): Physical size per pixel in micrometers (μm/pixel). Default is 1.0. This calibration parameter is essential for converting pixel-based measurements to physical units (μm, μm/s) and calculating accurate velocity and strain metrics.</li></ul><h3>Input Format</h3><p>Create a JSON file with the following structure:</p><pre>{<br>  \"image_sequence\": \"/path/to/timelapse/*.tif\",<br>  \"pixel_scale\": 0.65<br>}</pre><p>Alternative format with explicit file list:</p><pre>{<br>  \"image_sequence\": [\"/path/t0.tif\", \"/path/t1.tif\", \"/path/t2.tif\"],<br>  \"pixel_scale\": 0.65<br>}</pre><h3>Biological Use Case</h3><p>This tool enables quantitative analysis of tissue-scale dynamics in various biological processes. Applications include: measuring epithelial sheet migration during wound closure, quantifying flow patterns in developing embryos during gastrulation or convergent extension, analyzing collective cell migration in 3D spheroids or organoids, characterizing tumor cell invasion dynamics, and studying tissue morphogenesis and pattern formation. The velocity and deformation fields reveal mechanical coordination, identify regions of high strain or stress, and distinguish between different modes of tissue remodeling (e.g., cell rearrangement vs. cell shape change).</p><h3>Output</h3><p>The tool generates a JSON file (<code>tissue_deformation_results.json</code>) containing quantitative metrics including velocity vector fields, average flow speed, maximum strain rates, divergence and curl of the flow field, and temporal statistics. Visualization outputs may include velocity field maps, deformation heatmaps, and trajectory plots. These results support quantitative comparison of tissue dynamics across different experimental conditions, genotypes, or developmental stages.</p><h3>Category</h3><p>biophysics</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/biophysics/analyze_tissue_deformation_flow.py \"${imageSequence}\" -o \"${outputDir}\" -p \"${pixelScale}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Input",
      "name": "imageSequence",
      "label": "Image Sequence Pattern",
      "description": "Path to time-lapse microscopy images (glob pattern like '/path/to/images/*.tif')",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    },
    {
      "type": "Input",
      "name": "pixelScale",
      "label": "Pixel Scale",
      "description": "Physical size per pixel in micrometers (μm/pixel)",
      "defaultValue": "1.0"
    }
  ]
}