{
  "name": "biomni-analyze-cell-morphology-and-cytoskeleton",
  "title": "Biomni: Analyze Cell Morphology And Cytoskeleton",
  "description": "Quantifies cell morphology and cytoskeletal organization from fluorescence microscopy images.",
  "content": "<h3>Overview</h3><p>This tool performs quantitative analysis of cell morphology and cytoskeletal organization from fluorescence microscopy images. It extracts morphological features including cell shape, area, perimeter, eccentricity, and cytoskeletal alignment metrics to characterize cellular structure and organization. The tool applies advanced image segmentation and feature extraction algorithms to provide comprehensive morphometric data essential for understanding cell behavior, migration, and mechanobiology.</p><h3>Input Parameters</h3><ul><li><strong>image_path</strong> (string, required): Path to the fluorescence microscopy image file in stash. Supported formats include TIFF, PNG, and JPEG. The image should contain labeled cells or cytoskeletal structures.</li><li><strong>threshold_method</strong> (string, optional): Segmentation threshold method to distinguish cells from background. Options include 'otsu' (default), 'adaptive', or 'manual'. Otsu's method automatically determines optimal threshold for bimodal intensity distributions.</li></ul><h3>Biological Use Case</h3><p>This tool is valuable for studying cell migration, cytoskeletal dynamics, and cellular responses to mechanical or chemical stimuli. Example applications include: quantifying cytoskeletal reorganization during wound healing, analyzing cell shape changes in response to substrate stiffness, characterizing actin stress fiber alignment in mechanotransduction studies, and measuring morphological changes during epithelial-mesenchymal transition (EMT). The tool provides objective, reproducible measurements of cellular architecture that correlate with functional states and biomechanical properties.</p><h3>Output</h3><p>The tool generates a parameters (<code>cell_morphology_results.json</code>) containing quantitative morphological metrics including cell area, perimeter, circularity, aspect ratio, eccentricity, orientation angle, and cytoskeletal alignment scores. Visualizations may include segmentation masks and orientation field maps. Results enable statistical comparison across experimental conditions and temporal analysis of cellular dynamics.</p><h3>Category</h3><p>biophysics</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/biophysics/analyze_cell_morphology_and_cytoskeleton.py \"${imagePath}\" -o \"${outputDir}\" -t \"${thresholdMethod}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Stash File",
      "name": "imagePath",
      "label": "Image Path",
      "description": "Path to the fluorescence microscopy image file (TIFF, PNG, or JPEG)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    },
    {
      "type": "Input",
      "name": "thresholdMethod",
      "label": "Threshold Method",
      "description": "Segmentation threshold method (otsu, adaptive, or manual)",
      "defaultValue": "otsu"
    }
  ]
}