{
  "name": "biomni-predict-protein-disorder-regions",
  "title": "Biomni: Predict Protein Disorder Regions",
  "description": "Predicts intrinsically disordered regions (IDRs) in a protein sequence using IUPred2A.",
  "content": "<h3>Overview</h3><p>This tool predicts intrinsically disordered regions (IDRs) in protein sequences using the IUPred2A algorithm. Intrinsically disordered proteins (IDPs) and regions lack stable three-dimensional structure under physiological conditions but play crucial roles in cellular signaling, regulation, and molecular recognition. The tool analyzes amino acid composition and sequence properties to identify regions with high conformational flexibility and low folding propensity. IUPred2A uses an energy estimation approach based on pairwise interaction potentials to distinguish ordered and disordered regions with high accuracy.</p><h3>Input Parameters</h3><ul><li><strong>protein_sequence</strong> (string, required): Amino acid sequence in single-letter code (e.g., \"MKTAYIAKQRQISFVKSHFSRQLEERLGLIEVQAPILSRVGDGTQDNLSGAEKAVQVKVKALPDAQFEVVHSLAKWKRQTLGQHDFSAGEGLYTHMKALRPDEDRLSPLHSVYVDQWDWERVMGDGERQFSTLKSTVEAIWAGIKATEAAVSEEFGLAPFLPDQIHFVHSQELLSRYPDLDAKGRERAIAKDLGAVFLVGIGGKLSDGHRHDVRAPDYDDWSTPSELGHAGLNGDILVWNPVLEDAFELSSMGIRVDADTLKHQLALTGDEDRLELEWHQALLRGEMPQTIGGGIGQSRLTMLLLQLPHIGQVQAGVWPAAVRESVPSLL\"): Input must be a valid protein sequence containing only standard amino acids. Sequences can be obtained from UniProt, NCBI, or experimental sources.</li><li><strong>threshold</strong> (float, optional): Disorder probability threshold for classifying residues as disordered. Range: 0.0 to 1.0. Default is 0.5. Residues with disorder scores above this threshold are predicted as disordered. Lower thresholds increase sensitivity but may include false positives, while higher thresholds increase specificity.</li></ul><h3>Input Format</h3><p>Create a JSON file with the following structure:</p><pre>{<br>  \"protein_sequence\": \"MKTAYIAKQRQISFVKSHFSRQLEERLGLIEVQAPILSRVGDGTQDNLSGAEKAVQVKVKALPDAQFEVVHSLAKWKRQTLGQHDFSAGEGLYTHMKALRPDEDRLSPLHSVYVDQWDWERVMGDGERQFSTLKSTVEAIWAGIKATEAAVSEEFGLAPFLPDQIHFVHSQELLSRYPDLDAKGRERAIAKDLGAVFLVGIGGKLSDGHRHDVRAPDYDDWSTPSELGHAGLNGDILVWNPVLEDAFELSSMGIRVDADTLKHQLALTGDEDRLELEWHQALLRGEMPQTIGGGIGQSRLTMLLLQLPHIGQVQAGVWPAAVRESVPSLL\",<br>  \"threshold\": 0.5<br>}</pre><h3>Biological Use Case</h3><p>Intrinsically disordered regions are prevalent in regulatory and signaling proteins, transcription factors, and hub proteins in protein interaction networks. This tool aids in: identifying flexible linkers between protein domains, predicting binding sites for protein-protein interactions or post-translational modifications, characterizing proteins involved in phase separation and biomolecular condensates, analyzing disease-associated mutations in IDRs linked to neurodegenerative disorders (e.g., alpha-synuclein in Parkinson's disease), and guiding protein engineering by distinguishing structured and flexible regions. Understanding disorder propensity is essential for structural biology, drug design, and systems biology studies.</p><h3>Output</h3><p>The tool generates two output files: (1) <code>disorder_prediction_results.csv</code> containing per-residue disorder scores and binary predictions (ordered/disordered), and (2) <code>disorder_results.json</code> with summary statistics including number and location of disordered regions, average disorder score, and fraction of disordered residues. Results can be visualized as disorder propensity plots along the sequence, facilitating identification of functional motifs and structural domain boundaries.</p><h3>Category</h3><p>biophysics</p>",
  "command": "rm -rf prod_apps 2>/dev/null || true && git clone --depth 1 https://github.com/CamberCloud-Inc/prod_apps.git prod_apps && python3 prod_apps/biomni/biophysics/predict_protein_disorder_regions.py \"${proteinSequence}\" -o \"${outputDir}\" -t \"${threshold}\"",
  "engineType": "MPI",
  "jobConfig": [
    {
      "type": "Select",
      "label": "System Size",
      "name": "system_size",
      "hidden": true,
      "description": "Select the configuration for the job",
      "options": [
        {
          "label": "Extra Extra Small CPU",
          "value": "xxsmall_cpu",
          "mapValue": {
            "nodeSize": "XXSMALL",
            "numNodes": 1,
            "withGpu": false
          }
        }
      ],
      "defaultValue": "xxsmall_cpu"
    }
  ],
  "spec": [
    {
      "type": "Input",
      "name": "proteinSequence",
      "label": "Protein Sequence",
      "description": "Amino acid sequence in single-letter code (e.g., MKTAYIAKQRQIS...)",
      "defaultValue": ""
    },
    {
      "type": "Stash File",
      "name": "outputDir",
      "label": "Output Directory",
      "description": "Output directory in stash",
      "defaultValue": "./"
    },
    {
      "type": "Input",
      "name": "threshold",
      "label": "Disorder Threshold",
      "description": "Disorder probability threshold for classification (0.0 to 1.0)",
      "defaultValue": "0.5"
    }
  ]
}